var store = [{
        "title": "欧拉角、四元数、旋转矩阵推导及相互关系",
        "excerpt":"旋转与旋转矩阵 2D旋转 与右手系旋转方向相同的为旋转正方向 二维平面内旋转 \\[\\left( \\begin{matrix} x' \\\\ y' \\end{matrix} \\right) = \\left( \\begin{matrix} cosα &amp; −sinα\\\\ sinα &amp; cosα \\end{matrix} \\right) \\left( \\begin{matrix} x \\\\ y \\end{matrix} \\right)\\] 3D旋转 绕Z轴旋转α角 \\(\\left( \\begin{matrix} x' \\\\ y' \\\\ z \\end{matrix} \\right) = \\left( \\begin{matrix} cosα &amp; −sinα &amp; 0\\\\ sinα &amp;...","categories": [],
        "tags": ["数学"],
        "url": "https://zzmfish.github.io/DailyRead/2018/03/13/%E6%AC%A7%E6%8B%89%E8%A7%92-%E5%9B%9B%E5%85%83%E6%95%B0-%E6%97%8B%E8%BD%AC%E7%9F%A9%E9%98%B5%E6%8E%A8%E5%AF%BC%E5%8F%8A%E7%9B%B8%E4%BA%92%E5%85%B3%E7%B3%BB.html",
        "teaser": null
      },{
        "title": "张一鸣：10年面试2000人，我发现混的好的人，全都有同一个特质",
        "excerpt":"专注且高效的最好状态，是在轻度喜悦和轻度沮丧之间，不太激动，也不太郁闷，并且睡眠充足。   延迟满足，就是指为了更有价值的长远结果，而放弃即时满足，以及在等待中展示的自我控制能力。   ☁☁☁  刚毕业时工资差三五千块，真的可以忽略不计   当自己无法选择和判断的时候，就要离远一步，远到用更重要的原则和更长时间的尺度来衡量就清楚了。   延迟满足感，决定了你做判断时，是基于长期还是短期。   ☁☁☁  工作不分你我，做事不分边界   延迟满足感，会让你愿意主动做更多，得到更多的锻炼，而不是去斤斤计较「这是不是我该做的事情。」   ☁☁☁  曾四次创业，都没坚持到最后，创业如果不顺利，早死早升天   如果你的决定是对可见的最大系统，比如社会，是有增益的，你就应该做出更好的选择。   延迟满足感，会让你一直往前看，而不是满足于当下，满足于已有的成绩。   ☁☁☁  我创办今日头条，不是为了成为腾讯高管   这类事情，好处是明显的，坏处是隐含的，但这类情况很多人容易高估好处，低估坏处。这是一种典型的延迟满足感不够的体现，对长远信心不足。   延迟满足感，会让你不用天天想着春播秋收，而是先把最优的目标推得很远很远。   ☁☁☁  年轻人应该有更高的目标，不要局限在北京买一套房   延迟满足感，会让你有更高的目标，定更高的标准，也许你前两年变化得慢，但 10 年后再看，肯定会非常不一样。   绝大多数的人生痛苦，都是因为我们太在乎即时满足。一点付出，没有立马回报，就会觉得痛苦。   阅读原文   ","categories": [],
        "tags": ["自我提升"],
        "url": "https://zzmfish.github.io/DailyRead/2019/08/09/%E5%BC%A0%E4%B8%80%E9%B8%A3-10%E5%B9%B4%E9%9D%A2%E8%AF%952000%E4%BA%BA-%E6%88%91%E5%8F%91%E7%8E%B0%E6%B7%B7%E7%9A%84%E5%A5%BD%E7%9A%84%E4%BA%BA-%E5%85%A8%E9%83%BD%E6%9C%89%E5%90%8C%E4%B8%80%E4%B8%AA%E7%89%B9%E8%B4%A8.html",
        "teaser": null
      },{
        "title": "万字长文详解自动驾驶汽车技术：从感知、定位、处理规划到执行",
        "excerpt":"感知 摄像头 CCD 传感器 将电荷传输到芯片的特定角落进行读取，图像质量高 CMOS 传感器 每个像素都有自己的晶体管来读取与光的相互作用，功耗低，更容易制造 热成像相机 可以探测热物体（如行人或动物）和 峰值照明情况（如隧道末端） 多个指向同一方向的传感器组成的 立体相机 可以生成三维立体视图 缺少发射源会降低干扰 弱光或恶劣天气条件下 适应性差 👎 数据量大 👎 超声波雷达 短距离有效 驻车辅助 毫米波雷达 容易被 金属物体 反射 容易从 曲面反弹，可能对此类物体视而不见 空间分辨率低，对目标的形状信息不多，很难区分多个目标 👎 4D成像雷达 使用更高能量的 77-79GHz 电波 可以扫描 100 度的视野，最远可达 300米 高分辨率 激光雷达 机械扫描激光雷达 视野广阔，技术成熟 比较大，昂贵 👎 基于微机电系统（MEMS）的激光雷达 通过一个或多个微小的 倾斜镜 来分配激光脉冲，倾斜镜的角度由施加在倾斜镜上的 电压控制...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2020/09/12/%E4%B8%87%E5%AD%97%E9%95%BF%E6%96%87%E8%AF%A6%E8%A7%A3%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E6%B1%BD%E8%BD%A6%E6%8A%80%E6%9C%AF-%E4%BB%8E%E6%84%9F%E7%9F%A5-%E5%AE%9A%E4%BD%8D-%E5%A4%84%E7%90%86%E8%A7%84%E5%88%92%E5%88%B0%E6%89%A7%E8%A1%8C.html",
        "teaser": null
      },{
        "title": "Apollo Lite两周年：纯视觉L4级无人驾驶技术挑战复杂城市场景",
        "excerpt":"为什么是视觉方案？ 以 Waymo 为代表的Robotaxi阵营，选择用相对昂贵的 旋转式激光雷达 辅以多路摄像头和毫米波雷达直接落地 L4级自动驾驶。 以 Tesla 为代表的渐进式阵营，志在依托 海量数据和深度学习 从辅助驾驶起步跨越无人鸿沟，纯视觉方案是 兼顾驾驶体验和成本 的产品最优解。 激光雷达—拥抱生态 Waymo 推出其第五代自动驾驶传感器套件。Cruise、Argo、Aurora等头部公司也通过「收购+自研」布局未来的激光雷达产品。 百度明确走 开放 道路，相信拥有 大规模用户 和 成熟供应链体系 的生态合作伙伴必将迭代出性价比更优的产品。 选择自由—拿到视觉船票 重度依赖激光雷达的感知系统面临的问题之一便是 雷达技术的更新换代。基于三维点云的环境感知算法对 标注数据的累积 更加倚重，传感器数据变更后给现有感知模型的复用和泛化带来的挑战，前期构筑的数据壁垒优势也难以保持。 视觉成像技术的发展趋势清晰，视觉感知在 数据标注、数据复用和模型泛化 技术上都更加成熟可控。 冗余—做正确的事 起跑阶段，从快速解决问题的目标出发设计融合策略，代价是系统实现维护难度的增加和对安全问题自身可解释性的忽视。 多套能够支撑自动驾驶的感知系统独立工作相互校验，融合端减少策略深度耦合引入的数据依赖与人为假设。 视觉感知追求 独当一面的全栈能力。 Apollo Lite两周年画像 具备仅使用 10颗摄像头 应对中国复杂城市道路环境的自动驾驶能力。 纯视觉感知方案有多难？ 三维世界经 投影变换（Projective transformation） 被“压缩”到二维相平面上，成像过程中场景“深度”（景深）信息丢失了。 当算法再试图从二维图像中恢复目标物体原本在三维空间中所处的位置时，面对的是一个 欠约束的“逆问题”（ill-posed inverse...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2020/12/18/Apollo-Lite%E4%B8%A4%E5%91%A8%E5%B9%B4-%E7%BA%AF%E8%A7%86%E8%A7%89L4%E7%BA%A7%E6%97%A0%E4%BA%BA%E9%A9%BE%E9%A9%B6%E6%8A%80%E6%9C%AF%E6%8C%91%E6%88%98%E5%A4%8D%E6%9D%82%E5%9F%8E%E5%B8%82%E5%9C%BA%E6%99%AF.html",
        "teaser": null
      },{
        "title": "累死你的不是工作，而是不快乐的工作",
        "excerpt":"☁️☁️☁️ 工作是快乐之源 心流 是指一种 将个体注意力完全投注在某活动上 的感觉，心流产生时同时会有 高度的兴奋及充实感。 心流的体验，发生在工作时（54%）的机率，大大高于休闲时（18%）。 ☁️☁️☁️ 让工作快乐的四个条件 🍭意义感 工作内容要 符合自己的价值观，工作不只是挣钱，还感受到特别的意义； 学会把自己做的事嫁接到一个伟大的目标上。 🍭成就感 一个人做一件事时的 心理满足感； 当难度略高于技能 10%到20％ 的时候，最容易有成就感。 🍭成长 每个人最基本的动机之一，成长不仅可以获得满足感，还让自己 对未来充满信心； 让员工有成长感，一定要注意 及时的正面反馈。 🍭归属感 身份的认同； 好的组织 也会让员工产生归属感。 团队归属感最重要的东西是 “共同的回忆”： 1. 成功 我们 一起完成了一项了不起的事**，每个人都作出了贡献，而且每个人都知道他的贡献对于集体能干成这件事非常重要 2. 失败 失败会 让人成熟； 一起经历过失败，谁也 不推卸责任，大家都知道失败是什么样的，团队会变成熟 3. 关心 通过一些事情让人感觉到 集体很关心自己，这样就有了安全感 4. 示范 当你作为领导面临一个艰难选择的时候，你要让团队看到你是 如何做出正确选择的 ——...","categories": [],
        "tags": ["自我提升"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/08/%E7%B4%AF%E6%AD%BB%E4%BD%A0%E7%9A%84%E4%B8%8D%E6%98%AF%E5%B7%A5%E4%BD%9C-%E8%80%8C%E6%98%AF%E4%B8%8D%E5%BF%AB%E4%B9%90%E7%9A%84%E5%B7%A5%E4%BD%9C.html",
        "teaser": null
      },{
        "title": "蔚来ET7",
        "excerpt":"蔚来ET7      11 个  800 万像素高清摄像头   1 个 Innovution 的 1550nm波长 、等效300线的固态激光雷达、测距离500 米，最高辨率为 0.06°x0.06°，水平 FOV 视角达到了 120°   5 个毫米波雷达   12 个超声波雷达   2 个高精度定位单元   1 个车路协同感知   1 个增强主驾感知   1016 TOPS算力来源于四块英伟达 Drive Orin 自动驾驶芯片   150 kWh 固态电池   百公里 3.9 秒，前180kW 的永磁电机，后300kW 的异步电机   ","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/13/%E8%94%9A%E6%9D%A5ET7.html",
        "teaser": null
      },{
        "title": "地球加速自转",
        "excerpt":"减速50年，地球如今却开始加速自转！   上世纪以来，人们发现_地球的自转速度一直在减慢_，这可能是因为月球的潮汐作用。   最近科学家首次发现_地球的自转开始加快_。这可能与全球变暖有关，因为_融化的冰川可能会扰乱地球原始的质量分布或地质的运动_。   天文学家用距离地球相当远的其他恒星测得的一天的时长叫做“恒星日”。恒星日是23小时56分4秒。   原子钟是一种以原子共振频率标准来计算并保持时间准确的时钟，它是目前世界上准确度最高的钟表。原子钟的误差大约是每一亿年增加/减少1秒。   科学家预测今年地球的自转速度可能会更快，平均一天的持续时间预计将比86400秒少0.05毫秒，个别天数可能会少|1.5毫秒`。   卫星和其他通信设备通常基于太阳和恒星的位置，因此恒星日与地球原子钟的同步十分关键。   当恒星日与原子钟的偏差超过0.9秒时，科学家就会_调整原子钟的时间_，给它增加或减少1秒。   ","categories": [],
        "tags": ["科学"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/14/%E5%9C%B0%E7%90%83%E5%8A%A0%E9%80%9F%E8%87%AA%E8%BD%AC.html",
        "teaser": null
      },{
        "title": "拼多多漩涡背后：数字码农，从未逃出残酷的原始社会",
        "excerpt":"漩涡中心的拼多多 2020年12月29日凌晨1点30分，23岁 的拼多多女孩 张某霏，在下班回家的路上 昏倒，最终抢救无效离世。 拼多多知乎官方帐号 回复： 你看底层的人民，哪一个不是用命换钱，我一直不认为是资本的问题，而是这个社会的问题，这是一个用命拼的时代。你可以选择安逸的日子，但你就要选择安逸带来的后果，人是可以控制自己努力的，我们都可以。 1月7日，拼多多工程师 王太虚，目睹了一位男同事被送上了 救护车。他顺手拍下了一张图，并匿名发在了 脉脉 上。第二天，他被公司发现并且 辞退。 1月9日中午，拼多多员工 谭某 从家中 跳楼自杀，当场离世。 谭某部门执行 两班倒 轮班制度： 早班：早7点 — 晚11点； 晚班：晚7点 — 次日早7点，次日 下午3点 必须打卡上班。 互联网巨头的“丛林法则” 以 多多买菜 为例，供应链 和 物流 是核心。拼多多来要在短期内追上 快递巨头 十几年打造出来的物流能力是不可能的。所以最好的办法就是 烧钱 和 强力地推。这样一种模式注定了员工必须 疯狂加班。 2018年7月，成立不到三年的拼多多就以 240亿美金 的市值，在美国成功上市，如今市值已经超过了 2000亿美金。 创始人 黄峥 身家 586亿美元，成为了...","categories": [],
        "tags": ["互联网"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/14/%E6%8B%BC%E5%A4%9A%E5%A4%9A%E6%BC%A9%E6%B6%A1%E8%83%8C%E5%90%8E-%E6%95%B0%E5%AD%97%E7%A0%81%E5%86%9C-%E4%BB%8E%E6%9C%AA%E9%80%83%E5%87%BA%E6%AE%8B%E9%85%B7%E7%9A%84%E5%8E%9F%E5%A7%8B%E7%A4%BE%E4%BC%9A.html",
        "teaser": null
      },{
        "title": "何小鹏卖的是车吗",
        "excerpt":"蔚来卖的并不单纯是汽车，而更像是卖各种圈子门票的“商会”，只不过它的门票不是纸，而是一台台定位于高端品牌的纯电动车。   苹果最大的价值，在于它的产品几乎都非常好用，而这好用的基础，则来源于一个封闭又庞大的苹果软件生态系统。   雷军最想做的是打造一套成功的小米软件生态。但小米最近的一份财报（2020Q3）中显示单季营收721.6亿元，互联网服务收入占比仅8%。它并没有摆脱自己硬件公司的身份。   亨利福特开启了流水线生产，才让汽车的成本迅速降低，让工人们都能开上了车。   丰田发明了精益生产的方式，成功在不太影响产能的情况下，迅猛的提升了产品质量。   汽车竞争的本质中的一大部分，一直是_生产方式、生产效率、生产质量_上的竞争。   对于中国来说，从传统燃油车转变为新能源车的最根本需求，一是能源安全，二是产业升级，而智能汽车则是_汽车电动化后的伴随着的大转变_。   电池成本在这几年里以大约15%的速度在逐年下降。   搭载了更多半导体的新能源汽车，会迅速卷入到摩尔定律的发展大潮之中。   新能源的造车竞争很快就会转变成为一场没有止境的硬件竞赛。   先有硬件生产成本的大幅下降，才能有软件公司凭借足够的算力，开展出全新的生态业务。   硬件的发展，会受到需求的制约。没有足够的需求，硬件的成本就无法降下来。   这是一个死循环。   唯二打破死循环的方法，一个_等待整个市场的转变_。   第二个办法，那就是自己搞。用何小鹏自己的话说，叫一直在点亮人类科技树上的各种分叉。   所以这就是为什么何小鹏领导下的小鹏汽车做了五花八门，令人眼花缭乱的各种事情，但追根到底何小鹏这个人，自始至终一直在做一件事情，那就是_永远在为新科技、新硬件做准备的路上_。   定位低于P7的小鹏P5，却更早使用上激光雷达。   飞行汽车是小鹏汽车提前点亮了科技树上的“飞行”，试图去真正改变人类未来的出行方式。   每一次攀登、点亮科技树上未知的一部分，都代表着我们未来的生活，又多了成百上千中可能性。   阅读原文   ","categories": [],
        "tags": ["小鹏"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/16/%E4%BD%95%E5%B0%8F%E9%B9%8F%E5%8D%96%E7%9A%84%E6%98%AF%E8%BD%A6%E5%90%97.html",
        "teaser": null
      },{
        "title": "脘病毒,瑞辉疫苗死亡事件",
        "excerpt":"食人部落与“笑死病”：哺乳动物为什么不能同类相食？朊病毒告诉你答案   病毒是由一个核酸分子（DNA或RNA）与蛋白质构成的非细胞形态的类生物。   朊病毒的意思就是蛋白质病毒。它并不是严格意义上的病毒，现在普遍称之为“朊毒体”。   朊病毒可以自我复制，有极强的抗性，紫外线照射、电离辐射、高温、各种生化试剂、人体内的胃酸、蛋白酶都无法破坏它的结构。   疯牛病学名叫做“牛海绵状脑病（BSE）”，就是由朊病毒引起的，它是一种牛的神经系统传染性疾病。   20世纪末，一些国家将其它动物的肉骨粉加入牛饲料中。而这些肉和骨头的来源，可能就包含得了疯牛病死去的动物。当朊病毒与牛体内的正常蛋白接触时，会以一种人类目前无法理解的方式诱导正常蛋白质转化为朊病毒蛋白。朊病毒越来越多，脑组织被破坏，形成海绵空泡样改变。   人会得一种和疯牛病很相似的变异克雅氏病。病人会在 12～18 个月内死亡。变异克雅氏病可能和疯牛病感染有关，传播途径主要是消化道传播，比如进食受疯牛病感染的牛肉。   在太平洋西南部的岛国巴布亚新几内亚的福尔部落有着生食已故亲人遗体的习俗，包括脑部。有人叫他们“食人部落”。早在1905年被科学家研究的人类朊病毒疾病“库鲁病”，就诞生于这个部落。因为患者最终在哈哈大笑中死去，所以又叫“笑死病”。废除吃死尸的习俗之后，潜伏期漫长的库鲁症终于逐渐消失。   同类相食的行为不会凭空产生朊病毒。朊病毒通常会随着宿主的死亡而终结。同类相食使朊病毒从死体重新进入活体，于是开始了新一轮复制。   辉瑞疫苗频现接种者死亡事件，西方主流媒体为何集体沉默？   挪威 2.5万人注射了辉瑞疫苗，23人死亡。 德国有10人死亡。 法国有1人死亡。   辉瑞疫苗属于mRNA疫苗，以治疗性为主。如果病人已经感染了新冠病毒或有其他疾病，疫苗产生的异性蛋白质可能引起过敏反应甚至其他副作用，也有可能加重本身基础性疾病的病情。   国产疫苗目前主要是灭活疫苗，广泛作为预防性疫苗使用，安全性要好很多。   俄国家杜马议员茹拉夫列夫谴责这是在新冠疫情大流行期间西方制药公司的商业战引发的可怕后果。   俄直投基金称曾通过推特分享俄“卫星-V”疫苗的所有信息，但他们的账户却被平台限制用户访问。  ","categories": [],
        "tags": ["科学","国际"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/17/%E8%84%98%E7%97%85%E6%AF%92,%E7%91%9E%E8%BE%89%E7%96%AB%E8%8B%97%E6%AD%BB%E4%BA%A1%E4%BA%8B%E4%BB%B6.html",
        "teaser": null
      },{
        "title": "Statically configure a Firewall to let OMG DDS Traffic through",
        "excerpt":"DDS端口 The ports (and multicast addresses) used by DDS implementations (such as RTI Connext DDS) are specified by the OMG DDS Interoperability Wire Protocol Specification (DDS-RTPS).By default, each DomainParticipant opens 4 UDP/IP ports: Two of those ports are multicast ports which are shared among all domain participants in the same...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/19/Statically-configure-a-Firewall-to-let-OMG-DDS-Traffic-through.html",
        "teaser": null
      },{
        "title": "PonyAI：自动驾驶中轨迹规划的探索和挑战",
        "excerpt":"轨迹规划基本介绍 轨迹规划的概念 核心是解决车辆该怎么走的问题 输入 拓扑地图 障碍物 障碍物的预测轨迹 交通信号灯的状态 定位 导航 车辆状态 输出是一个 轨迹，是时间到位置的函数 t→(x,y,z) 为什么需要决策模块 决策 限定非凸问题（轨迹规划）的解空间，将问题转化为凸的 使解更加稳定 NP-hard（非确定性多项式困难）问题 需要决策的场景 抢行还是让行 是否要冲黄灯 在哪两辆车之间变道、并线 是否要主动变道 是从左还是右绕行前方障碍物 纵向规划决策求解：动态规划 将t - s 图进行 离散化 通过前边两步近似求出加速度，写出一个 状态转移方程 只能一个 大概的决策 方法，即到底让或者不让，不能保证舒适 决策面临的挑战 1、NP-hard问题，不易直接求解 2、很难用规则去拟合人的经验 3、场景多变而复杂 横向规划 横向规划的解法 无车道的场景：业界大多都用搜索等路径生成的方式去处理。 有车道的情况： 离线生成 参考线 将求解 s→(x,y) 的问题变为求解 s→l...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/20/PonyAI-%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E4%B8%AD%E8%BD%A8%E8%BF%B9%E8%A7%84%E5%88%92%E7%9A%84%E6%8E%A2%E7%B4%A2%E5%92%8C%E6%8C%91%E6%88%98.html",
        "teaser": null
      },{
        "title": "英特尔Mobileye发布FMCW激光雷达",
        "excerpt":"激光雷达原理 拍频原理 信号发生器发出频率随时间呈三角波变化的信号给发射机 接收机接收这个频率呈三角状变化的信号 通过对两个信号的拍频测量就可以得到距离信息 激光雷达性能指标 距离分辨力 单次测量中可区分的目标间最小距离 由光源调制带宽决定 角分辨力 单次探测中把距离R相同但是相对角度不同的目标区分开的能力 根据高斯光束的瑞利判据，光束发散角θ受到发射端准直器的孔径d与光载波波长λ的影响，满足θ=1.27λ/d 可区分的径向距离SA可表示为SA≥2R⋅sin(θ/2) 常用方法是增加天线孔径d以减小光束发散角 距离测量准确度 测得的距离分布的均值与真实距离之间的差距 主要受到光源频率调制的线性度和测量系统校准的影响 角测量准确度 受发射端扫描器件的角度准确度影响 距离测量与角测量结果的精度 对同一目标测量结果的一致性程度 受到光源的各参数稳定度和角扫描重复性与最小步长的影响 测量速率 获得一个探测数据的时间的倒数 主要受限于调制信号重复速率 高重复速率和长可探测距离不可兼得 调试技术 内调制技术 调制过程与激光振荡建立同时进行的调制 做成芯片是目前业内主要研发方向 半导体激光器本身的结电容限制了激光器的响应速率以及腔内光场建立时间的存在，使得可调谐范围、调谐速率、输出线宽等参数较难进一步提高 外调制技术 在激光振荡建立之后，在激光射出的光路上使用调制器对光场参数进行调 声光调制 工作带宽相对较窄 电光调制 体积庞大，难以芯片化 主要用在非车载领域 FMCW激光雷达的优势 信噪比高 功耗低 与距离物体远近不直接相关 ToF激光雷达越远测距准确度越低 与物体运动速度不直接相关 相对运动越快，ToF测距准确度越差，甚至出现物体畸变 FMCW激光雷达的缺点 成本高 旁瓣干扰 轻微延迟 成熟度...","categories": [],
        "tags": ["激光雷达"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/20/%E8%8B%B1%E7%89%B9%E5%B0%94Mobileye%E5%8F%91%E5%B8%83FMCW%E6%BF%80%E5%85%89%E9%9B%B7%E8%BE%BE.html",
        "teaser": null
      },{
        "title": "2020经济怎么看",
        "excerpt":"GDP同比增长2.3%   GDP突破100万亿元   人均GDP连续两年超1万美元   城镇新增就业1186万人   居民消费价格指数(CPI)比上年上涨2.5%   全国居民人均可支配收入实际增长2.1%   外汇储备余额32165亿美元，比上年末增加了1086亿美元   单位GDP能耗比上年下降0.1%   消费支出占GDP的比重54.3%      阅读原文   ","categories": [],
        "tags": ["经济"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/21/2020%E7%BB%8F%E6%B5%8E%E6%80%8E%E4%B9%88%E7%9C%8B.html",
        "teaser": null
      },{
        "title": "动态规划解题套路框架",
        "excerpt":"动态规划三要素 重叠子问题：使用备忘录来优化穷举过程，避免不必要的计算 最优子结构：通过子问题的最值得到原问题的最值 状态转移方程 斐波那契数列 0和1开始，之后每一项都等于前两项之和： 0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233…… 状态转移方程 \\[f(n)= \\begin{cases} 1, n=1或2\\\\ f(n-1)+f(n-2) \\end{cases}\\] 凑零钱问题 给你 k 种面值的硬币，面值分别为 c1, c2 … ck ，每种硬币的数量无限，再给一个总金额 amount ，问你最少需要几枚硬币凑出这个金额，如果不可能凑出，算法返回 -1 。 最优子结构 因为硬币的数量是没有限制的，所以子问题之间没有相互制，是互相独立的。 状态转移方程 \\[dp(n)= \\begin{cases} 0, n=0\\\\ -1, n&lt;0\\\\ min...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/21/%E5%8A%A8%E6%80%81%E8%A7%84%E5%88%92%E8%A7%A3%E9%A2%98%E5%A5%97%E8%B7%AF%E6%A1%86%E6%9E%B6.html",
        "teaser": null
      },{
        "title": "四维图新：如何做到行云流水的高精度地图",
        "excerpt":"揭秘高精度地图的生产过程   采集   1、专业采集车进行外业采集      提前分配任务   安装多种传感器：激光雷达、摄像头、惯性测量单元和定位设备   厘米级精度   设备较为昂贵   2、UGC设备采集      采集大量数据   精准地发现数据变化的范围   判断是否需要采集车进行有针对性的专业测量   处理      把不同传感器的采集数据进行融合叠加   道路元素识别：道路标线、路沿、路牌、交通标志   冗余数据整合和删除   验证      人工抽样检测   确认和完善   发布      生成矢量母库   借助云平台来实现发布及更新   影响高精度地图量产的关键因素   实时更新      准动态数据：分钟更新   实时动态数据：秒或毫秒更新   生产效率      需要布设很多高精度采集设备和车辆   较高的成本限制了高精地图的生产效率   地图存储问题      整体容量远远超出目前主流控制器方案的存储容量   需要借助云储存及云分发的形式   未来高精度地图的更新生态圈   未来的高精度地图更新，一定是一个云+端的完整生态圈。   未来智能网联汽车，既是云端地图数据成果的消费和使用者，同时也会是地图云中心部分数据的提供者。   面向量产四维图新的挑战和思考   覆盖超过32万公里高速公路   覆盖超过5000公里复杂城市道路   正在构建一个云+端的生态体系   更多源的第三方数据关联到地图   阅读原文   ","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/21/%E5%9B%9B%E7%BB%B4%E5%9B%BE%E6%96%B0-%E5%A6%82%E4%BD%95%E5%81%9A%E5%88%B0%E8%A1%8C%E4%BA%91%E6%B5%81%E6%B0%B4%E7%9A%84%E9%AB%98%E7%B2%BE%E5%BA%A6%E5%9C%B0%E5%9B%BE.html",
        "teaser": null
      },{
        "title": "阿里自研处理器成功运行Android 10",
        "excerpt":"阿里巴巴方旗下的平头哥半导体完成了安卓10对RISC-V的移植并开源了全部相关代码。   玄铁910处理器     目前业界最强的RISC-V处理器   单核性能7.1 Coremark/MHz   达到2.5GHz，比目前业界最好的RISC-V处理器性能高40%以上   安卓开源项目(AOSP)实现了对RISC-V架构的支持   本地库与ART支持     为bionic添加动态链接、系统调用、浮点数学库的支持   基于ART实现了RISC-V架构的DEX实时解释执行、dex2oat、JNI调用以及JIT编译优化     Linux内核支持       完善了Clang/LLVM对Linux内核的编译支持   修复了大量Clang/LLVM的问题   首次将RISC-V架构的Linux内核与安卓系统进行了适配   Build系统支持     整合编译框架、预编译的工具链、本地方法库、模拟器，应用和服务等模块   阅读原文   迎难而上  人活着，就要逢山开路、遇水架桥。很多时候，我们因为害怕而逃避，结果却是一退再退、无路可退。如果鼓起勇气直面问题，反而容易迎来转机。勇敢从不是本能，而是本事，是明知有困难依然愿意迎难而上。迷茫焦虑的时候，直面那些风浪吧！穿过风雨，你所期待的都会到来。  美好一天从“迎难而上”开始！  ","categories": [],
        "tags": ["科技"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/22/%E9%98%BF%E9%87%8C%E8%87%AA%E7%A0%94%E5%A4%84%E7%90%86%E5%99%A8%E6%88%90%E5%8A%9F%E8%BF%90%E8%A1%8CAndroid-10.html",
        "teaser": null
      },{
        "title": "百度Apollo：Cyber RT简介",
        "excerpt":"ROS 应用于自动驾驶的不足 独立进程的节点的运行顺序无法确定 分布式系统存在通信开销 Cyber RT 框架 基础库 高性能 无锁队列 通信层 Publish/Subscribe机制 Service/Client机制 服务自发现 自适应的通信机制（共享内存、Socket、进程内） 数据层 数据缓存与融合 计算层 计算模型 任务以及任务调度 运行流程 算法模块 通过有向无环图（DAG）配置任务间的逻辑关系； 每个算法可以进行优先级、运行时间、使用资源等方面的配置。 创建任务 结合DAG、调度配置创建任务； 内部协程（coroutine） 调度器 把任务放到各个 Processor队列 数据输入 Sensor 输入数据驱动系统运转 基本概念 Component 组件之间通过 Cyber channel 通信 Channel 管理数据通信 Node 每一个模块包含 Node 并通过 Node 来通信 Reader/Writer 订阅者模式，往 channel...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/23/%E7%99%BE%E5%BA%A6Apollo-Cyber-RT%E7%AE%80%E4%BB%8B.html",
        "teaser": null
      },{
        "title": "美国危险的根源（上）",
        "excerpt":"独立宣言 ~ 宪法政体构建（1776~1789）  汉密尔顿 领导的 联邦党。   1791年，杰斐逊 和 麦迪逊 组建了 民主共和党。   1812年 联邦党解散。   1825年民主共和党分为 民主党 和 辉格党。民主党代表着 南方地主、农民 的利益。   1854年 辉格党改名共和党，代表北方资产阶级 的利益。   民主党一家独大。   南北战争（1861~1865）   共和党 获得胜利，美国转型为一个资本主义国家。   罗斯福新政 ~ —二战（1933年~1945年）   美国成为世界霸主。   民主党成为新一代移民的代言人，变成一个自由主义政党。   共和党变成一个保守主义政党。   阅读原文   ","categories": [],
        "tags": ["国际"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/24/%E7%BE%8E%E5%9B%BD%E5%8D%B1%E9%99%A9%E7%9A%84%E6%A0%B9%E6%BA%90-%E4%B8%8A.html",
        "teaser": null
      },{
        "title": "心灵奇旅：活着就是活着的意义",
        "excerpt":"人生的意义 并不在于追求目标、实现目标。   如果人生的意义是完成目标，那么绝大多数人的人生岂不是就没有意义了？   就算是目标实现了又如何？   ☁☁☁  积劳成疾、不能享尽天年的“成功人士”非常之多。   当大脑发现获得奖励的机会时，它就释放出叫做 多巴胺 的神经递质，让人行动，以期获得快乐。   “奖励中心”只会让你 上瘾，不会让你快乐。   ☁☁☁  普普通通、平平常常地活着 就是活着的意义：   🍭身体的连接   🍭五官的感受   🍭友情   🍭亲情   🍭对其他人的关爱   ☁☁☁  成功 是达成目标、实现愿望、满足欲求。   幸福 不是一种状态，而是一种能力，是 感知快乐的能力。   和自己的童年和解，和平凡的自己和解，和野心勃勃的自己和解，和这个世界和解。   阅读原文   ","categories": [],
        "tags": ["自我提升"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/25/%E5%BF%83%E7%81%B5%E5%A5%87%E6%97%85-%E6%B4%BB%E7%9D%80%E5%B0%B1%E6%98%AF%E6%B4%BB%E7%9D%80%E7%9A%84%E6%84%8F%E4%B9%89.html",
        "teaser": null
      },{
        "title": "MongoDB rename databases",
        "excerpt":"The “copydb” command is deprecated, please use these two commands instead: mongodump to back up data mongorestore to recover data from mongodump into a new namespace 不赞成使用copy命令，请使用以下两个命令来代替： mongodump备份数据 mongorestore从mongodump的数据恢复到一个新的命名空间 We are aware of how painful and long it is to rename a database in MongoDB. Unfortunately, this is not an...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/26/MongoDB-rename-databases.html",
        "teaser": null
      },{
        "title": "美国多空大战：互联网+民粹主义，金融暴力+网络暴力",
        "excerpt":"美国散户逼空世纪大战   香橼研究 (CitronResearch) 的CEO发表对游戏驿站 (Gamestop) 做空的观点后，Reddit网站的华尔街赌注版块就开始有大V号召大家买进游戏驿站股票，和香橼公司、Melvin Capital等做空游戏驿站的基金对抗。   游戏驿站股价5个交易日涨幅高达788.32%。 一个交易日经历了17次熔断。   基础知识  融资  证劵公司借钱给你买股票，你在约定的时间内偿还。   看多  你通过融资买股票，股价上涨了，你卖掉股票赚钱了。   融券（卖空）  券商借你股票并帮你卖掉，你的账户里多了一笔现金，同时你欠券商股票，在约定的时间内必须偿还。   期货  买卖双方约定在未来某一时期以约定的价格买卖约定数量的股票。   ######期权 购买方支付premium权利金，可以在约定的时间以约定的价格卖出或买进一项标的的权利。卖方卖的是义务。   看跌期权（认沽期权）  对方卖出标的物的权利。   看涨期权（认购期权）  对方买入标的物的权利。   实物交割  期货、期权合约到期时，双方以实物为介质、在市场上走一圈变成现金。   现金交割  期货、期权合约到期时，双方直接现金结算。   保证金  交易的期货合约标的物总价的一个百分比，一般不低于6%。然后会每日盯市，如果保证金不够了，就会向你催缴。   平仓  不能及时缴纳保证金，导致亏损大保证金，交易所不让你玩下去。   阅读原文  ","categories": [],
        "tags": ["经济"],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/30/%E7%BE%8E%E5%9B%BD%E5%A4%9A%E7%A9%BA%E5%A4%A7%E6%88%98-%E4%BA%92%E8%81%94%E7%BD%91+%E6%B0%91%E7%B2%B9%E4%B8%BB%E4%B9%89-%E9%87%91%E8%9E%8D%E6%9A%B4%E5%8A%9B+%E7%BD%91%E7%BB%9C%E6%9A%B4%E5%8A%9B.html",
        "teaser": null
      },{
        "title": "解析国内第一款前装量产激光雷达：蔚来 vs 小鹏的选择",
        "excerpt":"蔚来      Innovusion 提供   多边形扫描器   等效300线   可以控制扫描区域，提高关键区域的扫描密度   最远探测距离500 米   水平 FOV 120°   功耗高，有电机转动部件      小鹏      Livox 基于浩界 Horizon 定制产品 Horiz   双楔形棱镜扫描器   探测距离150 米   0.1 秒下的等效144 线   水平 FOV  120°   花瓣型点云，中央密度高，外围密度低   扫描时间越长效果越好      小结   激光雷达是主动型传感器。   这意味着有着巨大的成本与性能挖掘潜力，也会存在多种技术路线竞争，每个厂家都会选择适合自己的路线和产品。   激光雷达与摄像头相比具有不识别即可提供 3D 信息的优势。   阅读原文   ","categories": [],
        "tags": ["激光雷达"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/01/%E8%A7%A3%E6%9E%90%E5%9B%BD%E5%86%85%E7%AC%AC%E4%B8%80%E6%AC%BE%E5%89%8D%E8%A3%85%E9%87%8F%E4%BA%A7%E6%BF%80%E5%85%89%E9%9B%B7%E8%BE%BE-%E8%94%9A%E6%9D%A5-vs-%E5%B0%8F%E9%B9%8F%E7%9A%84%E9%80%89%E6%8B%A9.html",
        "teaser": null
      },{
        "title": "四年烧掉百亿，威马上市难上岸",
        "excerpt":"1月29日，上海证监局网站上披露了中信建投关于威马汽车辅导工作的总结报告。威马距离科创板上市只有几步之遥了。   2020年，威马全年交付量为22495台，EX5销量在12月份甚至开始下滑。   2020年5推出EX6，售价23.99万-28.88万，5月到9月销量分别为82台、38台、52台、15台和72台。      营收体量是四家中最小      亏损逐年扩大，四年亏损114.09亿元      2020年威马一个月内连发至少四起自燃事件，随后召回共计1282辆汽车。   2019年蔚来接连发生起火事件，召回搭载共计4803辆ES8，召回成本高达3.39亿元。   威马的经营性现金流常年为负，且目前手头的现金及现金等价物还剩42亿元。年均亏损额接近30亿的威马，能否找到金主融资上市登陆二级市场，成了生死存亡的关键。   多位业内人士对威马评价是产品定位不清，没有核心竞争力。   百度数轮战略投资了威马，威马的智能技术很多时候需要靠百度赋能。过程中不但会遇到匹配难题，难以实现用软件训练硬件，最大的问题是，如果技术不掌握在自己手里，是没有未来的。   阅读原文  ","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/02/%E5%9B%9B%E5%B9%B4%E7%83%A7%E6%8E%89%E7%99%BE%E4%BA%BF-%E5%A8%81%E9%A9%AC%E4%B8%8A%E5%B8%82%E9%9A%BE%E4%B8%8A%E5%B2%B8.html",
        "teaser": null
      },{
        "title": "蔚来ES8开L2撞人又撞车，为啥装24个传感器都躲不开？",
        "excerpt":"事故原因 如果车速低于 8km/h 或大于 85km/h，自动紧急制动（AEB） 会启动。 搭载Brembo高性能刹车系统，从100km/h到0的刹车距离只有 33.8米。 根本原因是 感知系统。 ES8传感器 1 个前向 3 目摄像头 感知算法内嵌在 Mobileye EyeQ4 单目摄像头算法 5 个毫米波雷达 博世第四代毫米波雷达 中距离产品 MMR 感知算法内嵌在博世的主控芯片 ES8 小改款改成 德尔福 的雷达 4 个环视摄像头 12 个超声波雷达 1 个驾驶员监测摄像头 摄像头数据 ─➔ 感知算法(EyeQ4)─➔ EyeQ4──➔蔚来自主研发的融合算法──➔驾驶决策 ▲ | 雷达数据 ─➔ 感知算法(博世)───────┘ 博世雷达两种模式 1、提供32个 原始目标，车企自行结合视觉算法来判断 2、雷达从 32 个原始目标中筛选出...","categories": [],
        "tags": ["自动驾驶","电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/04/%E8%94%9A%E6%9D%A5ES8%E5%BC%80L2%E6%92%9E%E4%BA%BA%E5%8F%88%E6%92%9E%E8%BD%A6-%E4%B8%BA%E5%95%A5%E8%A3%8524%E4%B8%AA%E4%BC%A0%E6%84%9F%E5%99%A8%E9%83%BD%E8%BA%B2%E4%B8%8D%E5%BC%80.html",
        "teaser": null
      },{
        "title": "“中国制造”并非想象中那么强大",
        "excerpt":"原工信部部长苗圩：      “中国制造”不像我们想象那么强大，西方工业也没有衰退到依赖中国。我们的制造业还没有升级，但制造业者却已开始撤离。    全球制造业格局：      第一梯队是以美国为主导的全球科技创新中心；     第二梯队是高端制造领域，包括欧盟、日本；     第三梯队是中低端制造领域，主要是一些新兴国家，包括中国；     第四梯队主要是资源输出国，包括OPEC(石油输出国组织)、非洲、拉美等国。    全球科技实力排名：   美国   美国大学汇集了全球70%以上的诺贝尔奖获得者。   全球最顶尖的20所大学中美国占了17所。   全球十大科技顶尖公司美国占据了8家。   全球最顶尖的实验室。   军工、航空航天、医学技术、信息科学领域居世界之首。   英国   机器设备最核心的部分大多使用了由英国ARM公司设计的芯片。   诺奖获得人数，英国居世界第二。   在世界最好的200所大学中，美国占据了75所，英国占据了32所。   世界顶尖的航空发动机企业。   钢铁、制药、生物育种、航空航天、机械、微电子、军工、环境科学处于世界一流之列。   日本   美国国家专利局的专利申请数中，日本是第二大国。   在全球大学的排行榜和对世界科技贡献度上面，日本的大学仅次美英。   日本拥有很多大集团和大公司，如东芝，三菱。   在材料科学、尖端机器人拥有巨大科研实力。   法国   法国大学一般分为高等商学院和工程师学院，是典型的精英教育模式。   法国拥有五十多名诺奖获得者，十多名菲尔兹奖获得者。   航天、能源、材料科学、空间技术的优势比较明显。   德国   机床，精密机械。   七十多位获得诺贝尔奖。      阅读原文  ","categories": [],
        "tags": ["经济"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/08/%E4%B8%AD%E5%9B%BD%E5%88%B6%E9%80%A0-%E5%B9%B6%E9%9D%9E%E6%83%B3%E8%B1%A1%E4%B8%AD%E9%82%A3%E4%B9%88%E5%BC%BA%E5%A4%A7.html",
        "teaser": null
      },{
        "title": "如何高效测评自动驾驶感知系统性能表现？",
        "excerpt":"RS-Reference 是 RoboSense（速腾聚创） 的 真值系统+测评 工具链，推向市场3年以来，已服务于多家国际顶级OEM和Tier1。 什么是真值数据 要比待测系统 (DuT) 更准确 囊括感知系统的众多信息 PB 级的数据量 生成效率要跟上开发需求 如何获取 数据收集 128线激光雷达 RS-Ruby 近场补盲激光雷达 RS-Bpearl Leopard 摄像头 大陆408 毫米波雷达 GI-6695 RTK 分体式的顶装部署 感知算法+离线处理 高质量真值数据 13 年算法技术积累 离线感知算法 充足的计算资源 全栈式测评工具链 包括 采集工具、传感器标定工具、可视化工具、人工校验工具、测评工具 对感知融合结果进行测评 激光雷达、毫米波雷达、摄像头 测评工具模块 路牌&amp;路面标识、车道线类别、场景语义识别 测评工具模块 按客户需求开发定制化工具模块 拓展应用价值 构建仿真场景 并行开发规划控制系统 测评路端感知系统 全套解决方案 1、产品体系 MEMS 与机械式激光雷达...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/08/%E5%A6%82%E4%BD%95%E9%AB%98%E6%95%88%E6%B5%8B%E8%AF%84%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E6%84%9F%E7%9F%A5%E7%B3%BB%E7%BB%9F%E6%80%A7%E8%83%BD%E8%A1%A8%E7%8E%B0.html",
        "teaser": null
      },{
        "title": "特斯拉还会继续降价，10-20万车型受冲击较大",
        "excerpt":"汽车行业的竞争力更多要看一个公司的管理机制：一是管理团队的相互配合，二是关于新团队的塑造。   新能源车在中国、包括全球的占比是5%左右，未来目标在2025年提到15-20%，未来几年整个赛道的确定性非常强。   在全球新能源车产业链中，中国企业会扮演更多的角色，未来的市场重心一定是在中国和美国。所以从长期看题，新能源车的估值并不贵。   高端和低端的电动车卖的很好，但中端市场（10-20万）仍然是传统车消费的主力。新能源车对传统车最核心的替代需求还没有形成。   特斯拉以智能电动车为主，创造了一种新增的需求。到大家对电动车的自发需求形成越来越强烈的时候，会对传统车及电动车市场带来比较大的冲击。   软件定义汽车是一个趋势，伴随自动驾驶和智能座舱的快速推进，需要整个产业链一起来协同。   零部件领域，包括热管理、汽车电池、车灯，行业空间足够大，龙头公司的竞争优势会不断凸显。      阅读原文  ","categories": [],
        "tags": ["经济","电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/14/%E7%89%B9%E6%96%AF%E6%8B%89%E8%BF%98%E4%BC%9A%E7%BB%A7%E7%BB%AD%E9%99%8D%E4%BB%B7-10-20%E4%B8%87%E8%BD%A6%E5%9E%8B%E5%8F%97%E5%86%B2%E5%87%BB%E8%BE%83%E5%A4%A7.html",
        "teaser": null
      },{
        "title": "中国航天突围64年",
        "excerpt":"1957年10月4日，苏联的 斯普特尼克1号🚀 发射成功，成为世界上第一颗人造卫星🛰️。11月3日，搭载一只🐶的 斯普特尼克2号 也发射成功； 1958年2月，美国发射了 探险者1号（Explorer-1） 。 1965年11月，法国发射了 阿斯特里克斯卫星（Asterix）。 1970年2月，日本发射了 大隅卫星。 1970年4月24日，中国的长征一号运载火箭搭载着东方红一号卫星，在酒泉卫星发射中心成功升空。 1986年1月28日，挑战者号航天飞机升空后爆炸💥失事震惊了全世界。 1986年5月30日，欧洲 阿丽亚娜2号火箭 因第三级点火故障，发射后不到5分钟就星箭俱毁💥。 1990年4月7日，中国长城工业公司在西昌卫星发射中心，用长征三号火箭成功发射休斯公司制造的亚洲一号卫星。从此中国打开了 国际商业卫星发射服务市场💰。 1996年2月15日，长征三号乙火箭发射国际708通信卫星发生剧烈爆炸💥，星箭俱毁，造成6人死亡💀，57人受伤。 1996年8月18日，长征三号运载火箭发射中星七号通信卫星时，发生点火故障导致发射失败❌。 1999年5月，美国 《考克斯报告》 认定休斯、劳拉两公司泄密并间接推动了中国导弹技术的进步。美国开始 限制对中国商业卫星出口。 2011年，美国“沃尔夫条款”规定NASA和OSTP的航天航空项目不得与中国官方进行技术交流，也不接待 中国学者🖐️。 2011年5月16日，奋进号航天飞机 在 肯尼迪航天中心 等待发射，任务是将迄今为止在太空运行的最强大、有15个国家的科学家参与的粒子物理探测器 阿尔法磁谱仪 送往国际空间站。但临近发射时NASA却 取消了中国记者的采访资格🖐️。 2012年，神舟九号升空并与 天宫一号 顺利对接并返回🎉。嫦娥二号完成 绕月探测🎉 后，宣布将对 图塔蒂斯小行星(4179 Toutatis) 进行飞跃探测。美国却 关闭了原本开放的数据库🖐️。 2013年10月，NASA 艾姆斯研究中心 举行由美国与国际研究团队报告 寻找太阳系外行星 的研究结果的会议，但 中国籍研究人员遭禁入🖐️。 2013年12月，嫦娥三号实现了无人登月探测器在月球软着陆🎉。...","categories": [],
        "tags": ["科技"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/15/%E4%B8%AD%E5%9B%BD%E8%88%AA%E5%A4%A9%E7%AA%81%E5%9B%B464%E5%B9%B4.html",
        "teaser": null
      },{
        "title": "全球资产价格存在非常大的泡沫",
        "excerpt":"全球资产价格上升 自从2020年3月，以美联储为首的全球央行推出史无前例的 量化宽松刺激政策 以来，全球资产价格出现了明显的上升，包括全球 股市（尤其是头部企业股票）、房地产市场、加密货币。 加密货币暴涨 反映了全球 对于无限制的主权货币发行的发行量大幅增加的担忧和不满。 资产价格高估的消化方式 实体经济增长 1) 房租 或者 上市公司盈利 增加 股票或者房地产价格的下跌 1) 日本1990年以后 2) 美国2008年以后 如果市场 对于政府的救助和刺激抱有强烈的一致预期，投资者会认为这是一种 理性的、得到了政府支持的泡沫。 引发泡沫破裂的原因 流动性的收紧 1) 全球资金面的紧张 2) 安全资产利率的上升和投资者风险偏好的下降 黑天鹅事件的发生（新冠疫情） 1) 全社会的流动性的紧张 2) 投资者的风险偏好下降 3) 全球经济活动的萎靡 蝴蝶效应 对比历史上的暴涨有的相同点 对于政府和对于流动性的强烈预期 强烈的自我实现的预期 1) 涨幅越大、估值越高的资产越得到投资者的追捧 2) 游戏驿站事件 对比历史上的暴涨有的不同点 全球的流动性环境 全球央行所投放的流动性的增量远远大于2008年全球金融危机时投放的流动性 资产价格的分化愈加严重 总结 根本原因是投资者的非理性心理...","categories": [],
        "tags": ["经济"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/26/%E5%85%A8%E7%90%83%E8%B5%84%E4%BA%A7%E4%BB%B7%E6%A0%BC%E5%AD%98%E5%9C%A8%E9%9D%9E%E5%B8%B8%E5%A4%A7%E7%9A%84%E6%B3%A1%E6%B2%AB.html",
        "teaser": null
      },{
        "title": "寒潮下的美国得州，穷人不配用电？",
        "excerpt":"得州大规模停电   极寒天气几乎冰冻了整个美国，最低气温零下23摄氏度，冻死人数已经超过了33人。   至少14个州的电网出现故障，得克萨斯州电力系统几乎瘫痪，一晚上就有11人丧生。   美国电网   得州电力20%来源于风力，40%来源于天然气的火力发电。风力发电机和天然气管道被冻住，是大停电的主要原因。   美国其他州的电力公司由 联邦电力监管委员会(FERC) 监管，得州大部分电网由得州电力可靠性委员会(ERCOT) 调度管理。   美国有电力企业3000多家，其中私营企业服务用户占比72.6%。70%的输电线路和变压器运行年限超过25年，60%的断路器运行年限超过30年。   私营企业首先考虑划算不划算，宁可接受电力事故，也不愿意因小概率事件而对电网设施进行投资和维护。   得州供电瘫痪，一个原因就是电网方主动切断了居民区的电力供应。   党派纠纷   2007年次贷危机，失业率一度高达10%。   2009年奥巴马上台，大力发展新能源。   2012年之后，美国新增的发电能力中，风能占到了一半。   太阳能发电增长了40倍。   2006—2016年，美国煤炭发电量减少了53%，美国40%的煤电厂濒临破产或已经破产。   2017年特朗普上任，废除多条环保法案，支持煤炭发电，还以安全的名义禁止美国从中国进口电力系统设备。   但是特朗普没能阻挡清洁能源大趋势。2017年煤炭发电所占份额为30%，到了2019年仅为24%。   双城记   得州大面积停电同时，得州富裕社区却灯火通明。   许多美国官员认为，为防范危机进行投资几乎没有任何政治回报，他们根本就没有去主动应对危机的动力。   美国为了应对突发灾害，特别成立了联邦紧急事务管理局(FEMA)。   1992年安德鲁飓风发生6天后，FEMA才派人进行救灾，大批民众死于饥饿和寒冷。   2005年卡特里娜飓风 FEMA在灾害现场不作为，还把救灾物错配到没有受灾的州。   2006年纽约遭遇了暴风雪，FEMA却“见死不救”，理由是纽约州没有宣布进入“紧急状态”。   富人们选择雇佣私人消防员来保护自己的安全，每天服务价格达到上千美元。   尾声   春节我们南方同样遇到了“百年一遇”的寒潮。   南方电网10千伏以上的电路，每天有6000人次除冰工作，且配备了巡冰无人机。在除冰方面，还配备激光大炮、激光雷达、机动式车载直流融冰装置。万家灯火，一盏也没有熄灭。  ","categories": [],
        "tags": ["国际"],
        "url": "https://zzmfish.github.io/DailyRead/2021/02/27/%E5%AF%92%E6%BD%AE%E4%B8%8B%E7%9A%84%E7%BE%8E%E5%9B%BD%E5%BE%97%E5%B7%9E-%E7%A9%B7%E4%BA%BA%E4%B8%8D%E9%85%8D%E7%94%A8%E7%94%B5.html",
        "teaser": null
      },{
        "title": "自动驾驶仿真超全综述",
        "excerpt":"   ➥打开思维导图   ➥阅读原文  ","categories": [],
        "tags": ["思维导图","自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/02/%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E4%BB%BF%E7%9C%9F%E8%B6%85%E5%85%A8%E7%BB%BC%E8%BF%B0.html",
        "teaser": null
      },{
        "title": "激光雷达：车载先行，助力3D感知与交互时代",
        "excerpt":"激光雷达 利用 激光 以实现 精确测距 的传感器 激光雷达产品分类 ☛ 测距原理 TOF、FMCW、AMCW、三角法 ☛ 扫描方式 机械式 难以达到车规级量产要求 转镜 唯一真正上车 法雷奥 SCALA 2017年 奥迪A8 至2019年出货10万颗 华为（北汽） 大疆Livox（小鹏） Innovusion（蔚来） MEMS 磁 或者 静电 驱动的微振镜 微机电系统工艺 Innoviz（2021年 宝马iX） 速腾聚创（2021年量产） 法雷奥 SCALA 第三代（2022年左右量产） Flash 纯固态 量产上车需要 5年 左右 车载激光雷达的 终极形态 OPA 纯固态 量产上车需要 5年 左右 车载激光雷达的 终极形态...","categories": [],
        "tags": ["激光雷达"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/04/%E6%BF%80%E5%85%89%E9%9B%B7%E8%BE%BE-%E8%BD%A6%E8%BD%BD%E5%85%88%E8%A1%8C-%E5%8A%A9%E5%8A%9B3D%E6%84%9F%E7%9F%A5%E4%B8%8E%E4%BA%A4%E4%BA%92%E6%97%B6%E4%BB%A3.html",
        "teaser": null
      },{
        "title": "非常强悍的 RabbitMQ 总结",
        "excerpt":"非常强悍的 RabbitMQ 总结 AMQP协议 ☛ Broker 实现AMQP实体服务，接受客户端连接 ☛ Connection 网络连接 ☛ Channel 网络信道，消息读写的通道 ☛ Message 服务器和应用程序之间传递的数据。 包括： ☞ properties: 对消息进行修饰，如 优先级，延迟 ☞ body: 消息实体内容 ☛ Virtual Host 逻辑隔离的虚拟主机 ☛ Exchange 接受消息，根据路由键转发消息到绑定的队列 类型： ☞ Direct Exchange: 消息被转发到 RouteKey 指定的Queue ☞ Topic Exchange: 消息被转发到Routing key 模糊匹配的 Topic 的Queue上 * 匹配一个单词 # 匹配一个或多个单词...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/04/%E9%9D%9E%E5%B8%B8%E5%BC%BA%E6%82%8D%E7%9A%84-RabbitMQ-%E6%80%BB%E7%BB%93.html",
        "teaser": null
      },{
        "title": "《金刚经》里的这四句话，让人如大梦初醒",
        "excerpt":"   若菩萨有我相，人相，众生相，寿者相，皆非菩萨。     （如果你看到的菩萨，他长的像我这样的人，或者你这样的人，或者像路人甲乙丙这样的人，再或者像一个长寿的人，那他都不是菩萨。）    我们在寺庙里看到的佛祖，根本就不是真正的佛祖。那只是一个 相 而已。   🍁🍁🍁     凡以色拜我，以音声求我，是人行邪道，不能见如来。     （凡是看见我就拜我的人，或者听到我的声音就来求我的人，都是执迷于佛祖表相，这是邪道，永远都见不到如来。）    其实很多人烧香拜佛，拜的是自己的 欲望，他们是在求 不属于自己的东西，比如财富/名利等等。   🍁🍁🍁     凡所有相皆为虚妄，若见诸相非相，则见如来。     （如果一个人不再被事物的表象所迷惑，能看透各种事物表象背后的本质，就相当于见到佛祖的真身了。 ）    大家之所以看不到真相，也是因为 真相往往都是复杂又残忍的，一个人没有足够的 勇气和智慧，即便你把真相和价值呈现在他面前，他也接纳不了。   🍁🍁🍁     一切有为法，如梦幻泡影，如露亦如电，应作如是观。     （一切能被表述出来的方法，都不是永恒的方法，就像露水和闪电一样，随时都会破灭。）    方法是 认知提升到一定阶段 自己悟出来的，是靠 执行和实践 逐渐摸索出来的，这个世界上没有放之四海而皆准的道理，更不会有直接拿来就可以用的办法。   🍁🍁🍁  阅读原文  ","categories": [],
        "tags": ["自我提升"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/08/%E9%87%91%E5%88%9A%E7%BB%8F-%E9%87%8C%E7%9A%84%E8%BF%99%E5%9B%9B%E5%8F%A5%E8%AF%9D-%E8%AE%A9%E4%BA%BA%E5%A6%82%E5%A4%A7%E6%A2%A6%E5%88%9D%E9%86%92.html",
        "teaser": null
      },{
        "title": "毛利转正营收翻倍亏损收窄，小鹏首份年报的含金量有多少？",
        "excerpt":"财务数据 2020 全年毛利率 4.6%，Q4 毛利率7.4%。 小鹏、蔚来、理想均实现了年毛利率的转正，证明 智能电动汽车的大势鼎立，势不可挡。 Q4 总交付为 12964台，帮助全年总交付达到 27041台。P7 Q4 交付 8527台，全年交付了 15062台。 2020年的总收入 58.44 亿元，净亏损 27.32 亿元。 电话会议 2021年 Q1 的交付指引 12500台，收入指引 26亿元。 全场景语音 每月、每天的使用率均超过了 90%。 20% 的 P7 激活了 NGP，2月份里程渗透率超过 50%。 第四季度 正式交付搭载 车规级激光雷达 的 A+级轿车。 3月 开始交付的 P7 鹏翼版。 4、5 月份 开始交付 磷酸铁锂电池版本 G3 和...","categories": [],
        "tags": ["小鹏","电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/09/%E6%AF%9B%E5%88%A9%E8%BD%AC%E6%AD%A3%E8%90%A5%E6%94%B6%E7%BF%BB%E5%80%8D%E4%BA%8F%E6%8D%9F%E6%94%B6%E7%AA%84-%E5%B0%8F%E9%B9%8F%E9%A6%96%E4%BB%BD%E5%B9%B4%E6%8A%A5%E7%9A%84%E5%90%AB%E9%87%91%E9%87%8F%E6%9C%89%E5%A4%9A%E5%B0%91.html",
        "teaser": null
      },{
        "title": "有关安全，蔚来的知其所以然",
        "excerpt":"实验中心   全铝车身材料实验室           身材料性能、车身连接工艺 的研究和判定            5000 多个关键数据       光学实验室      摄像头 的光学测试、图像评估以及感知算法验证   挡风玻璃 的光学参数制定和研发   激光雷达 的光学零部件和仪器性能评估   驾驶体验仿真模拟平台      亚洲首个、国内唯一 的 九自由度 驾驶模拟器        响应时间 18ms            在整车开发前期阶段，进行 驾乘性能 的主观评价       ADAS系统算法的早期验证   三电实验室   储能技术实验室   研究换电、移动、充电等   电磁实验室   国内新能源车车企 唯一自建   软件相关的实验室   网络、整车电子集成、子系统、FOTA 、车辆数据监控、信息娱乐   五星秘密   正面25%偏置碰撞 完整避开了车辆的 前防撞梁 和 纵梁，发生的几率只有 6%，但死亡率却高达 30%。   从用户出发 的安全设计，去研发一款 让用户安心 的产品，而不是去做 「应试考试」。      阅读原文  ","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/12/%E6%9C%89%E5%85%B3%E5%AE%89%E5%85%A8-%E8%94%9A%E6%9D%A5%E7%9A%84%E7%9F%A5%E5%85%B6%E6%89%80%E4%BB%A5%E7%84%B6.html",
        "teaser": null
      },{
        "title": "人生最大的幸运，是撬开“认知枷锁”！",
        "excerpt":"认知闭环 人生最大的悲哀，由于教育的先入为主，使我们过早的形成了 小认知闭环，并且 被紧紧的禁锢其中，无法看到更大的世界。 人生破局的关键，就在于不断的构建 大认知闭环，从而 提升自己的格局，领略人间更多风景。 👣👣👣 认知差距 一个社会发达， 科技水平越高，贫富差距 就会越大，智商差距 也越大，认知差距 也越大。 因为社会的发展水平越高，财富和信息的流行性 就会越好。此时财富会加剧流向更有钱的人，而信息会被高认知水平的人 掌控，从而去 操控 那些认知水平低的人 未来的世界，将被分割成一个个的小单元格，相同的人被放在同样的单元格，单元格的墙壁十分坚实，每个人都活在自己的 信息茧房（认知监狱）里。这些人之间 互相肯定和认可，拥有共同的一片天，然后利用 短视频/直播/游戏/网购 等等，让他们玩的不亦乐乎，最后再把他们 折叠 起来。 👣👣👣 99%的人是谁？ 这99%的人都将被沦陷，它们需要的不是成长/被唤醒，或者价值。而是 情绪安慰，是 麻醉和幻象，是 短平快的各种刺激。 所以互联网上最容易传播的从来就是各种 情绪和偏见，而不是真正的价值，这99%的人自以为掌握了各种真理和见识，其实他们只是 把情绪当理性，把信息当知识，把偏见当思想。 这99%的人都将越来越 野蛮化，生物本性 将越来越凸显，因为这种情况会导致人们越来越 依靠本能、情绪、应激反应去处理各种事情。人的动物本能如果不加控制并且驯化，其 群体效应 就会越来越明显，走向 群体的非理性，成为一群 乌合之众。 👣👣👣 1%的人是谁？ 这1%的人能通过 自律/学习/精进 等等成功的进行 延迟满足，面对着大千世界，他们练就了一颗 如如不动之心，保持“精进”。...","categories": [],
        "tags": ["自我提升"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/17/%E4%BA%BA%E7%94%9F%E6%9C%80%E5%A4%A7%E7%9A%84%E5%B9%B8%E8%BF%90-%E6%98%AF%E6%92%AC%E5%BC%80-%E8%AE%A4%E7%9F%A5%E6%9E%B7%E9%94%81.html",
        "teaser": null
      },{
        "title": "造车新势力车载摄像头都装在哪？",
        "excerpt":"厂商与车型 毫米波雷达 车载摄像头 激光雷达 超声波雷达 芯片 算力 小鹏 P7 5 13   12 英伟达 Xavier 30 TOPS 小鹏 G3 3 5 (1前视，4环视)   12 Mobileye Eye Q4 2.5 TOPS 蔚来 ET7 5 11 1 12 英伟达 Drive Orin * 4 1016 TOPS 蔚来 ES8/ES6 5 5 (1三目，4环视)   12 Mobileye...","categories": [],
        "tags": ["电动车","自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/03/28/%E9%80%A0%E8%BD%A6%E6%96%B0%E5%8A%BF%E5%8A%9B%E8%BD%A6%E8%BD%BD%E6%91%84%E5%83%8F%E5%A4%B4%E9%83%BD%E8%A3%85%E5%9C%A8%E5%93%AA.html",
        "teaser": null
      },{
        "title": "Waymo主帅离职疑云：自动驾驶商业化不力？L4太难？",
        "excerpt":"Waymo CEO John Krafcik 宣布离职。 CTO Dmitri Dolgov (2009年加入) 和 COO Tekedra Mawakana (2017年加入) 作为联席 CEO 接任。 Waymo 谷歌自 2008年 开始自动驾驶研发。 在美国 25 个城市的 公共道路 上自动驾驶数千万英里，并积累了超过 200 亿公里 的 模拟测试 里程； 在凤凰城部署了 600 辆 左右 Waymo One 自动驾驶打车服务； 与 菲亚特·克莱斯勒 和 捷豹 达成了 车辆采购 合作； 和 沃尔沃 达成 L4 级自动驾驶出租车量产...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/05/Waymo%E4%B8%BB%E5%B8%85%E7%A6%BB%E8%81%8C%E7%96%91%E4%BA%91-%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E5%95%86%E4%B8%9A%E5%8C%96%E4%B8%8D%E5%8A%9B-L4%E5%A4%AA%E9%9A%BE.html",
        "teaser": null
      },{
        "title": "小马智卡来了！中国估值最高的自动驾驶独角兽首曝卡车战略",
        "excerpt":"小马智行累计测试里程已经超 500 万 公里，公司估值超 53 亿 美元，累计融资超 11 亿 美元。   卡车业务探索始于 2018 年 8 月，正式的名称：小马智卡 PonyTron。   传感器      2 个 禾赛科技 64 线激光雷达   6 个摄像头   3 个毫米波雷达   2 根GNSS 天线   物流业      体量巨大   事故率偏高   成本高   规模小   货运司机缺口巨大   商业化   在未来 3 年内，将整套自动驾驶的成本降到司机一年的收入      阅读原文  ","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/05/%E5%B0%8F%E9%A9%AC%E6%99%BA%E5%8D%A1%E6%9D%A5%E4%BA%86-%E4%B8%AD%E5%9B%BD%E4%BC%B0%E5%80%BC%E6%9C%80%E9%AB%98%E7%9A%84%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E7%8B%AC%E8%A7%92%E5%85%BD%E9%A6%96%E6%9B%9D%E5%8D%A1%E8%BD%A6%E6%88%98%E7%95%A5.html",
        "teaser": null
      },{
        "title": "海外物价飞涨，多国加息！对我们有何影响？如何看待当下市场？",
        "excerpt":"多国加息   苏伊士运河 堵了很久，大宗商品一直运不出去，供给跟不上，导致原材料涨价。   疫苗 推进在全球加速，经济需求恢复，但是原材料供给跟不上，就出现涨价和通胀。   物价上涨可能会导致 加息，资产价格（楼市、股市）就会有波动。   土耳其、巴西、俄罗斯 物价涨得太快，于是引发了加息。   原因   资源型经济体      特别多的自然资源   较难发展出现代工业、制造业和服务业（资源的诅咒）   周期性大   资本项目完全开放      阅读原文  ","categories": [],
        "tags": ["经济"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/05/%E6%B5%B7%E5%A4%96%E7%89%A9%E4%BB%B7%E9%A3%9E%E6%B6%A8-%E5%A4%9A%E5%9B%BD%E5%8A%A0%E6%81%AF-%E5%AF%B9%E6%88%91%E4%BB%AC%E6%9C%89%E4%BD%95%E5%BD%B1%E5%93%8D-%E5%A6%82%E4%BD%95%E7%9C%8B%E5%BE%85%E5%BD%93%E4%B8%8B%E5%B8%82%E5%9C%BA.html",
        "teaser": null
      },{
        "title": "威马「迷航」：CTO上月出走、IPO自动放弃",
        "excerpt":"威马合伙人 &amp; CTO 闫枫 2004 年加入 上汽，2013 年担任上汽 副CIO。2021 年 3 月 10 日从威马离职。   威马在 2020 年 10 月申请 上市辅导，并且已经于今年 1 月完成，后来选择了 自动放弃（中止上市）。   威马在寻求 百度 融资支持时，曾接受了对方的竞业条款，不能自己做自动驾驶，而是使用百度的 Apollo 系统。百度在造车上却选择了 吉利 作为合作伙伴。      阅读原文   ","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/06/%E5%A8%81%E9%A9%AC-%E8%BF%B7%E8%88%AA-CTO%E4%B8%8A%E6%9C%88%E5%87%BA%E8%B5%B0-IPO%E8%87%AA%E5%8A%A8%E6%94%BE%E5%BC%83.html",
        "teaser": null
      },{
        "title": "功能场景为纲---国产毫米波雷达商业化策略",
        "excerpt":"CEO 楚詠焱 是 亚琛工大 电子信息学硕士，在 博世 从事雷达研发管理13年；   CTO 张我弓 是 德国斯图加特大学 半导体工程博士，曾在德国工作 15年，期间在 博世 主导 第三代雷达天线 设计；   COO 李烜 是 汉诺威大学 CAE硕士，在德国 博坦德公司 工作12年。   2018年1月 在 合肥 成立的 楚航科技 已获得A+轮 数亿元 融资，公司遍布 南京、上海、合肥、安庆、德国。   产品创新性：行人分辨（偏振算法）、目标分离和抗干扰、功能安全 ASIL B，特别是 整车厂安装免校准。   要保证车辆安全，就是找到 每个传感器的优点和缺点，并且知道在哪种场景下谁占 主导，划好这个 边界。   利用 多普勒效应 基本原理的毫米波雷达可用于车内的 生命体征检测。   阅读原文  ","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/08/%E5%8A%9F%E8%83%BD%E5%9C%BA%E6%99%AF%E4%B8%BA%E7%BA%B2-%E5%9B%BD%E4%BA%A7%E6%AF%AB%E7%B1%B3%E6%B3%A2%E9%9B%B7%E8%BE%BE%E5%95%86%E4%B8%9A%E5%8C%96%E7%AD%96%E7%95%A5.html",
        "teaser": null
      },{
        "title": "重重挑战下，比亚迪如何重回王位？",
        "excerpt":"2020年比亚迪销售汽车 42.7万辆，其中新能源汽车 18.9万辆，燃油汽车 23.7万辆，同比分别下降了 18% 和增加了 1%。同期中国市场新能源车和燃油车的销量分别上涨了 10% 和下降了 6.8%。 2020年7月，比亚迪 汉上市。2020年下半年总销量超过 4万辆。2021年1、2月销量分别为 12103、5028辆。 营收组成： 电池和光伏: 一直在 7-8% 徘徊 汽车业务: 大致占 50% 手机部件和组装 大致占 40% 比亚迪电子 是利润层面的“顶梁柱”，从2018年至今，净利润 贡献都保持在 70% 之上。 比亚迪坚持 买外来不如自己造，前后发展出了 19 个事业部。其中与汽车相关的有 13 个，与电池相关的主要有 2 个。 2016-2020年比亚迪的毛利润能维持在 15-20%，略高于传统燃油车企业 10+% 的水平。 Model 3外部供应商大概有 59 个，比亚迪汉只用了 31个。 比亚迪的历史： 1995年-2002年，手机电池生产制造； 2002年-2009年，手机...","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/08/%E9%87%8D%E9%87%8D%E6%8C%91%E6%88%98%E4%B8%8B-%E6%AF%94%E4%BA%9A%E8%BF%AA%E5%A6%82%E4%BD%95%E9%87%8D%E5%9B%9E%E7%8E%8B%E4%BD%8D.html",
        "teaser": null
      },{
        "title": "“北斗”背后的GNSS技术，到底是个啥？",
        "excerpt":"什么是GNSS GNSS 是 全球导航卫星系统（Global Navigation Satellite System），是能在地球表面或近地空间的任何地点，为用户提供全天候的 三维坐标、速度 以及 时间 信息（PVT，Position Velocity and Time）的空基无线电导航定位系统。 全球系统 美国 GPS 俄罗斯 GLONASS 欧洲 Galileo 中国 BDS 区域系统 日本 QZSS 印度 IRNSS 增强系统 美国 WAAS 日本 MSAS 欧盟的EGNOS 工作原理 一个用户终端要想解算出自己的准确位置，必须要有至少4颗卫星 关键技术 A-GNSS 通过陆基的移动通信网络，传送增强改正数据，提供辅助信息，加强和加快卫星导航信号的搜索跟踪性能和速度，缩短定位时间，提高定位精度 实时动态差分法（RTK，Real-time kinematic） 实时处理两个测量站载波相位观测量的差分方法 航位推算（DR，Dead Reckoning） 通过采用 加速度传感器 和 陀螺仪传感器，可以根据用户终端的初始位置信息以及传感器获得的信息，推算出用户终端在 盲区位置 的高精度导航数据。...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/14/%E5%8C%97%E6%96%97-%E8%83%8C%E5%90%8E%E7%9A%84GNSS%E6%8A%80%E6%9C%AF-%E5%88%B0%E5%BA%95%E6%98%AF%E4%B8%AA%E5%95%A5.html",
        "teaser": null
      },{
        "title": "“劈柴”掌权这几年，谷歌怎么就成了另一个百度？",
        "excerpt":"AI Jeff Dean 1999年 加入谷歌，目前领导着科研部门 Google AI，将 分布式计算 系统应用于公司的广告、网页抓取、索引等系统，并且很早成立了 机器学习/深度学习 科研部门。 2017年，Pichai 发文指出，世界正在经历一次重大的科技转型，从移动优先转向 AI 优先。 谷歌 AI 技术的产品整合大多 无法直接带来收入。 TPU (Tensor Processing Unit) 是 面向深度学习训练和推理的专门计算设备，一直仅供 内部使用 和接受 非常有限的第三方使用申请，而 没能尽快提供给广大开发者。 开发者也有 AWS、微软 Azure 等基于 GPU 的方案可选。 以 英伟达 为代表的硅谷芯片型公司，发布了专门面向深度学习的产品。 非核心业务 2015年 谷歌完成了拆分重组，非核心业务独立化，由母公司 Alphabet 看管着。 2020财年 亏损 45亿美元。 1、光纤宽带 Fiber 只有 数量有限的城市...","categories": [],
        "tags": ["互联网"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/18/%E5%8A%88%E6%9F%B4-%E6%8E%8C%E6%9D%83%E8%BF%99%E5%87%A0%E5%B9%B4-%E8%B0%B7%E6%AD%8C%E6%80%8E%E4%B9%88%E5%B0%B1%E6%88%90%E4%BA%86%E5%8F%A6%E4%B8%80%E4%B8%AA%E7%99%BE%E5%BA%A6.html",
        "teaser": null
      },{
        "title": "华为 HI 上车，自动驾驶轻松干掉特斯拉？38.89万你买吗？",
        "excerpt":"阿尔法 S HI 版 硬件方案： 3 个激光雷达 13 个摄像头：前向 5 个，侧向 6 个，后向 2 个 6 个毫米波雷达：4 个角雷达，前后各 1 个雷达； 12 个超声波雷达 中央计算单元是由华为 ADS 部门自研的域控制器，算力达到 400 Tops。 华为 ADS 系统 NCA 模式 高精度地图 覆盖； 城区、高速、泊车 全场景 自动驾驶； 优先安排 北上广深 的高精度地图绘制。 ICA+ 模式 没有完整的高精度地图； 车速会放慢，提示接管的情况也会增多； 通过多次驾驶进行路线的学习、建图，提升自动驾驶系统在区域内的可用性。 ICA 模式 大致相当于基础版 Autopilot 功能...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/18/%E5%8D%8E%E4%B8%BA-HI-%E4%B8%8A%E8%BD%A6-%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E8%BD%BB%E6%9D%BE%E5%B9%B2%E6%8E%89%E7%89%B9%E6%96%AF%E6%8B%89-38.89%E4%B8%87%E4%BD%A0%E4%B9%B0%E5%90%97.html",
        "teaser": null
      },{
        "title": "Git 版本及版本范围表示法",
        "excerpt":"指定版本 &lt;sha1&gt; git describe 命令输出 &lt;refname&gt; 符号引用，例如 master 通常代表 refs/heads/master。 @ HEAD &lt;refname&gt;@{&lt;date&gt;} 如 master@{yesterday}、HEAD@{5 minutes ago} &lt;refname&gt;@{&lt;n&gt;} 该引用之前的第 n 个值，如 master@{1} 代表 master 之前的值 @{-&lt;n&gt;} 之前第 n 次检出的分支或者提交 &lt;rev&gt;^ 直接父提交，^&lt;n&gt; 代表第 n 个父提交 &lt;rev&gt;~&lt;n&gt; 第 n 个祖先提交 :/&lt;text&gt; 提交信息匹配正则表达式的最近一次提交 指定范围 &lt;rev&gt; rev 的所有祖先 ^&lt;rev&gt; 不包含从 rev 可以追踪到的提交 &lt;rev1&gt;..&lt;rev2&gt; 包含从...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/21/Git-%E7%89%88%E6%9C%AC%E5%8F%8A%E7%89%88%E6%9C%AC%E8%8C%83%E5%9B%B4%E8%A1%A8%E7%A4%BA%E6%B3%95.html",
        "teaser": null
      },{
        "title": "惊艳背后的问号 ——关于华为自动驾驶系统的首次亮相",
        "excerpt":"交通灯 推测：每个红绿灯的位置和高度在 HDmap 中有标定值，根据视觉捕捉的红绿黄信号进行UI上的填充处理。 第一次无保护左转 在国内的这种无保护左转的通行条件下，如果倾向保守的安全性，那就会造成 局部拥堵、被后车鸣笛催促等小范围的交通混乱。华为这个 抵近式——刹停——再贴着直行车尾左转 的动作，看似激进，实则必要。 Tesla 的 FSD基本都是 等停——通过 的机制，通过路口的效率很慢。 Waymo 的 Robotaxi 服务还有 规避左转 的规划政策，一个左转可抵达的目的地，会导致绕路执行四个右转。 Lidar助力下可以在 低时延 内获取 高置信度 的路口车流状态和测量结果，针对“他车”的状态预测很快而且比较准确，包括他车的 位置、速度、加速度、指向 和基于此的 未来轨迹预测。 第二次无保护左转 十字路口通常是 大范围的正方形区域，无地面标识线，自动驾驶的难点区域之一。 Tesla FSD 是 优选前车跟随，直到可以视觉捕捉目标方向上的目标车道，再做微调。 华为应该是借助 高精地图 和 高精定位（融合定位），可以准确进入目标车道。 直行被左转车辆干扰 主车作为直行车辆在有优先权的前提下，在受到转弯车辆威胁之后，大脚刹车后，立刻在威胁解除之后恢复到正常速度。 通过机动车、非机动车、行人干扰路段 对于国内普遍存在的开放社区路段，难点体现在： 对向机动车辆不遵守道路中心线分割原则而借道行驶 主车也有需要借道的需求 路旁泊车侵占非机动车道，导致非机动车驶入机动车道，并有大量的横穿现象 行人横穿马路无规则 机器最重要的是在 感知能力过关 的基础上，执行...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/27/%E6%83%8A%E8%89%B3%E8%83%8C%E5%90%8E%E7%9A%84%E9%97%AE%E5%8F%B7-%E5%85%B3%E4%BA%8E%E5%8D%8E%E4%B8%BA%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E7%B3%BB%E7%BB%9F%E7%9A%84%E9%A6%96%E6%AC%A1%E4%BA%AE%E7%9B%B8.html",
        "teaser": null
      },{
        "title": "瑕不掩瑜，应对于华为技术寄予厚望（1） ——关于华为自动驾驶系统的夜间表现",
        "excerpt":"路口区间内执行变道   车辆自动驾驶决策的输出，不应该是建立在对于交通规则的破坏基础之上的。   Tesla 的 Autopilot 是尽可能采用 数据驱动 的 NN神经网络结构 方式来构造自动驾驶控制链条上的每一个模块。   决策阶段的细节上的处理，是每个 厂家自己的判断和理解，以及和 执法机构、立法机构 的互动结果。   中控UI显示问题   UI给出的场景和驾驶员肉眼观测到的外部场景精准重合，这是 培养人类对于机器信心 的重要前提之一。   变道过程中遇到后车挑战   极狐阿尔法 S 的 Lidar 设备集中在车头前端，在暗光条件下的换道操作，必须依赖 侧视和后视摄像头 的联合工作。   阅读原文  ","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/27/%E7%91%95%E4%B8%8D%E6%8E%A9%E7%91%9C-%E5%BA%94%E5%AF%B9%E4%BA%8E%E5%8D%8E%E4%B8%BA%E6%8A%80%E6%9C%AF%E5%AF%84%E4%BA%88%E5%8E%9A%E6%9C%9B-1-%E5%85%B3%E4%BA%8E%E5%8D%8E%E4%B8%BA%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E7%B3%BB%E7%BB%9F%E7%9A%84%E5%A4%9C%E9%97%B4%E8%A1%A8%E7%8E%B0.html",
        "teaser": null
      },{
        "title": "印度：无药可医贫​",
        "excerpt":"   根据世界银行的估算，2015年，全球共有 7.36亿 极端贫困人口（日收入低于 1.9美元），其中印度有 1.76亿，约占24%。   印度正在进行一场大规模的减贫运动。直到2018年，其极端贫困人口已减少到1亿以下。   疫情带来了衰退。2020/21财年，印度经济预计 下滑8%，为近60年来最低增速。   皮尤研究中心估计，由于疫情，印度的极端贫困人口从 6000万 增加至 1.34亿，   4月21日，印度新增确诊病例 31.48万人。此后六天，印度单日新增病例都在30万以上。        中国疫情之初，医用口罩生产企业只 330多家，日产量只有 800万只。   两个月后，医用口罩生产企业变成了7 80多家，日产能突破 1亿只。   一年之后，医用口罩生产企业变成了 3000多家，口罩日产量高达 55亿只。     中国800台制氧机从香港运至德里，本周还将运去1000台。各国的援助也在不断运往印度，同时仍有印度公司正从中国采购制氧机。   印度中央政府计划在新德里建设8座变压吸附制氧工厂，但因新德里政府不发放许可而被拖延。新德里首席部长Arvind Kejriwal随后回应，中央政府完全是虚假陈述，以掩饰其在制氧工厂建设上的失败。印度确实是一个我们不太能理解的国家，中央政府居然要跟地方政府互相甩锅。   但与其说这一切是思维、信仰、意志的问题，我更愿意将其理解为 能力的差别。   中国的制造业增加值是印度的接近十倍，名义数值领先20多年。      阅读原文  ","categories": [],
        "tags": ["国际"],
        "url": "https://zzmfish.github.io/DailyRead/2021/04/28/%E5%8D%B0%E5%BA%A6-%E6%97%A0%E8%8D%AF%E5%8F%AF%E5%8C%BB%E8%B4%AB.html",
        "teaser": null
      },{
        "title": "苏州豪米波雷达白杰：未来属于4D毫米波雷达点云​",
        "excerpt":"多传感器数据融合的层次与结构 传感器处理层次 数据 特征 决策 局部传感器数据处理结构 集中式 把传感器所有信息送到 域控制器 当中处理。 优点是数据处理的精度高； 缺点是大量数据易造成通信负载过大，对控制器处理的性能要求高。 分布式 每个传感器会将自身目标观测结果在本地进行相关 目标检测与跟踪 处理，送入域控制器的是已经完成多目标跟踪的 局部航迹 信息。 优点是对通信带宽的需求低、计算速度快； 缺点是跟踪的精度远没有集中式高。 混合式 兼具集中式和分布式结构的优点，弥补了两者的不足。 空间匹配 需要进行多个传感器坐标系之间的转换，包括 世界坐标系，需要知道 大地坐标系 还有 车辆坐标系。 在传感器坐标系当中，主要是 图像坐标系、雷达坐标系，还有 激光雷达坐标系。 以相机和毫米波雷达为例，主要是需要标定 相机的内参和外参矩阵。 时钟同步 硬件同步 主要是设置一个硬件多线程触发，例如毫米波雷达和图像处理数据传输的频率或是采样频率不同，雷达采样频率一般要低于视频数据。那么，可以通过雷达检测后，以 硬件触发 方式来获得图像信息。这个方案更适用于以下情况，即 雷达相机一体化 的低成本方案，当然硬件方面比较复杂。 软件同步 目前常用的方案，大部分可以用GPS加入一个 时间戳，如毫米波雷达和相机，采集的数据都有GPS时间戳，后面根据最近匹配或通过差值方法进行 数据补偿，常用的有线性差值、拉格朗日差值法。 相机和雷达融合的经典方法 决策级/目标级融合与数据关联 由传感器分别在控制器中完成目标检测，得到 目标位置信息 和 分类信息...","categories": [],
        "tags": ["自动驾驶"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/12/%E8%8B%8F%E5%B7%9E%E8%B1%AA%E7%B1%B3%E6%B3%A2%E9%9B%B7%E8%BE%BE%E7%99%BD%E6%9D%B0-%E6%9C%AA%E6%9D%A5%E5%B1%9E%E4%BA%8E4D%E6%AF%AB%E7%B1%B3%E6%B3%A2%E9%9B%B7%E8%BE%BE%E7%82%B9%E4%BA%91.html",
        "teaser": null
      },{
        "title": "华为入局 「造车」始末：结盟、较量、历史自觉​",
        "excerpt":"华为的国产汽车朋友圈 北汽 极狐阿尔法 S 华为 HI 版搭载了 华为 ADS 高阶自动驾驶全栈解决方案（包括 华为高算力智能驾驶计算平台 MDC 810 + 华为激光雷达），同时在车机上搭载了 鸿蒙 OS 操作系统 和 麒麟 990A 芯片，并且在动力层面采用了 华为的 AI 闪充动力域高压平台解决方案，可以说是一款充满华为元素的电动车。 长安 长安与华为目前已经达成的合作： 长安正在论证使用 华为云，来增加其车联网云服务的稳定性； 人工智能服务，比如说 语音识别； 自动驾驶训练、仿真。 首款高端汽车品牌车型预计将于今年底发布，在 座舱、底盘、电驱、电池、电控 等都在深度使用华为的方案。 广汽 联合打造一款 L4 级的无人驾驶汽车，2024 年投产。 赛力斯 重庆 小康股份 旗下的新能源汽车品牌，负责人为小康股份创始人张兴海的公子 张正萍。 小康股份 2016 年在美国硅谷成立了 SF Motors，并且聘请了特斯拉联合创始人...","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/13/%E5%8D%8E%E4%B8%BA%E5%85%A5%E5%B1%80-%E9%80%A0%E8%BD%A6-%E5%A7%8B%E6%9C%AB-%E7%BB%93%E7%9B%9F-%E8%BE%83%E9%87%8F-%E5%8E%86%E5%8F%B2%E8%87%AA%E8%A7%89.html",
        "teaser": null
      },{
        "title": "印度调查报告​",
        "excerpt":"厕所和神牛 2018年的政府官方数据是 44% 的农村人口在野外排便。 无论在哪里，都见到无数的牛群。这些牛都是有主人的，撞到的话大概要赔 1000-1500元 人民币，而且保险不理赔。 农业 印度现在单季一亩产量 250 公斤 ，中国在袁隆平时单季亩产 900 多公斤。 印度有 1.6-1.7 亿 公顷可耕地，中国有 1.2-1.3 亿 公顷可耕地，印度还 一年三熟，中国一般 一年两熟。世界银行2017年数据，中国 粮食产量全球最高为 6.179 亿吨，美国 排第二为 4 .4 亿吨，印度 第三为 3.316 亿吨。 印度农业落后的主要原因是因为 工业化与水利、农机落后。 这个村有4000名村民，只有一半的人有地，有人拥有200-300英亩地（约1200-1800亩地），普通人家一般只有2-3英亩地。这些有很多田地的人，最后都成了政客。 全世界土地私有制一定会发生这样的事，土地一定会发生兼并现象，大地主会在基层将经济和政治权力进行双重绑定。 贫民窟 孟买有全亚洲最大的 达拉维贫民窟。贫民窟已经形成了自己的 内循环，有一整套完整的系统，包括各式各样的 作坊、小工厂、学校、诊所。 贫民窟的人在这里的小作坊上班，挣着 1000元 人民币左右的工资。贫民窟里的学费是 1400元 人民币一年，贫民窟外的学校是 3500元 一年。 印度政府确实在执行15岁以下...","categories": [],
        "tags": ["国际"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/16/%E5%8D%B0%E5%BA%A6%E8%B0%83%E6%9F%A5%E6%8A%A5%E5%91%8A.html",
        "teaser": null
      },{
        "title": "拜登「喊话」背后丨决战汽车电动化：中美争锋，殃及德日",
        "excerpt":"美国 美国总统 拜登 近日在 福特工厂 参观时公开“点名”中国： 电动汽车是汽车工业的未来。而现在，中国却在这场竞赛中保持领先。 美国绝对不会允许中国赢！ 此前，拜登政府曾发布了一项 2万亿 美元的基建计划，其中划出 1740亿 美元支持美国的电动汽车产业。 2020年的美国电动化率为 2.2%，而同期中国和欧洲的电动化率分别为 5.4% 和 7.7%。 🌲🌲🌲 中国 中国拥有世界上最大、增长最快的电动汽车市场。目前 80% 的电动汽车电池由中国制造，在 德国 和 墨西哥 都设有生产链，并着眼于向美国市场出口。 2020年，中国已经建成 80万 座公共充电站，是美国公共充电站数量的8倍。 国务院规划，到2025年我国新能源汽车新车销量占汽车新车总销量的 20% 左右。 🌲🌲🌲 德国 2019年整体产能为 466万 辆汽车，同比 下降47万 辆。 宝马 在各类驱动系统上发力：燃机、插电混动、纯电动和氢燃料电池； 每年 200万 台左右的销量让它无力同时专注四大系统； 对生产平台进行了改造，无论哪种驱动系统，都能使用相同的生产线； 在技术和设计上妥协，纯电动车始终差强人意而且成本更高。 戴姆勒 针对驱动系统和宝马有着相同的战略； 较高的...","categories": [],
        "tags": ["电动车"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/20/%E6%8B%9C%E7%99%BB-%E5%96%8A%E8%AF%9D-%E8%83%8C%E5%90%8E%E4%B8%A8%E5%86%B3%E6%88%98%E6%B1%BD%E8%BD%A6%E7%94%B5%E5%8A%A8%E5%8C%96-%E4%B8%AD%E7%BE%8E%E4%BA%89%E9%94%8B-%E6%AE%83%E5%8F%8A%E5%BE%B7%E6%97%A5.html",
        "teaser": null
      },{
        "title": "一文搞懂Raft算法",
        "excerpt":"概览 Raft 是工程上使用较为广泛的 强一致性、去中心化、高可用的分布式协议。 Raft 协议是一种 leader-based的共识算法，与之相应的是 leaderless 的共识算法。 ☁☁☁ Leader Election 一个节点任一时刻处于以下三个状态之一： leader follower candidate 每个 leader 工作一段时间，然后选出新的 leader 继续负责，每一届新的履职期称之为一届 任期（term）。 任期是递增的，充当了逻辑时钟的作用。 ☁ 如果 follower 在 election timeout 内没有收到来自 leader 的心跳，则会主动 发起选举： 增加节点本地的 current term ，切换到candidate状态 投自己一票 并行给其他节点发送 RequestVote RPCs 等待其他节点的回复 情况 1️⃣：收到majority的投票（含自己的一票），则赢得选举，成为 leader； 情况 2️⃣：被告知别人已当选，那么自行 切换到 follower； 情况...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/21/%E4%B8%80%E6%96%87%E6%90%9E%E6%87%82Raft%E7%AE%97%E6%B3%95.html",
        "teaser": null
      },{
        "title": "Bazel——Sandboxing",
        "excerpt":"Sandboxing 🐣restricting file system access 🐣constructs an execroot/ directory for each action 🐣execroot/ contains all input files to the action Reasons for sandboxing 🐣not know if a tool uses undeclared input files 🐣incorrect reuse of cache entries creates problems during remote caching 🐣closely related to remote execution sandboxfs 🐣a FUSE...","categories": [],
        "tags": ["软件开发"],
        "url": "https://zzmfish.github.io/DailyRead/2021/05/22/Bazel-Sandboxing.html",
        "teaser": null
      }]
