var store = [{
        "title": "钟南山话太极,蔚来ET7,快乐工作",
        "excerpt":"2021年1月13日 星期三 钟南山为什么如此推崇太极拳？ 慢阻肺 的全称是慢性阻塞性肺疾病，是一种常见的，反复发作的，以持续气流受限为特征的慢性呼吸系统疾病，通常见于长期吸烟的人。慢阻肺发病的原因之一就是体内的二氧化碳潴留，无法呼出。 太极拳因为思想清净，动作缓慢、柔和、放松，消耗的机体能量很少，因而体内产生的二氧化碳就少。 太极拳因为要进行深长细匀的腹式呼吸，因而呼吸功能得到有效的锻炼，吸入更多新鲜的氧气，潴留的二氧化碳得以排出。 最后就是打太极拳要求落地生根，经常有半蹲的姿势，对下肢也是非常好的锻炼。 蔚来ET7 11 个 800 万像素高清摄像头 1 个 Innovution 的 1550nm波长 、等效300线的固态激光雷达、测距离500 米，最高辨率为 0.06°x0.06°，水平 FOV 视角达到了 120° 5 个毫米波雷达 12 个超声波雷达 2 个高精度定位单元 1 个车路协同感知 1 个增强主驾感知 1016 TOPS算力来源于四块英伟达 Drive Orin 自动驾驶芯片 150 kWh 固态电池 百公里 3.9 秒，前180kW 的永磁电机，后300kW 的异步电机 累死你的不是工作，而是不快乐的工作 工作是快乐之源 心流是指一种将个体注意力完全投注在某活动上的感觉，心流产生时同时会有高度的兴奋及充实感。...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/13/%E9%92%9F%E5%8D%97%E5%B1%B1%E8%AF%9D%E5%A4%AA%E6%9E%81,%E8%94%9A%E6%9D%A5ET7,%E5%BF%AB%E4%B9%90%E5%B7%A5%E4%BD%9C.html",
        "teaser": null
      },{
        "title": "地球加速自转",
        "excerpt":"0114.地球加速自转   2021年1月14日 星期四   减速50年，地球如今却开始加速自转！   上世纪以来，人们发现_地球的自转速度一直在减慢_，这可能是因为月球的潮汐作用。   最近科学家首次发现_地球的自转开始加快_。这可能与全球变暖有关，因为_融化的冰川可能会扰乱地球原始的质量分布或地质的运动_。   天文学家用距离地球相当远的其他恒星测得的一天的时长叫做“恒星日”。恒星日是23小时56分4秒。   原子钟是一种以原子共振频率标准来计算并保持时间准确的时钟，它是目前世界上准确度最高的钟表。原子钟的误差大约是每一亿年增加/减少1秒。   科学家预测今年地球的自转速度可能会更快，平均一天的持续时间预计将比86400秒少0.05毫秒，个别天数可能会少|1.5毫秒`。   卫星和其他通信设备通常基于太阳和恒星的位置，因此恒星日与地球原子钟的同步十分关键。   当恒星日与原子钟的偏差超过0.9秒时，科学家就会_调整原子钟的时间_，给它增加或减少1秒。   ","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/14/%E5%9C%B0%E7%90%83%E5%8A%A0%E9%80%9F%E8%87%AA%E8%BD%AC.html",
        "teaser": null
      },{
        "title": "statically-configure-a-firewall-to-let-omg-dds-traffic-through",
        "excerpt":"Statically configure a Firewall to let OMG DDS Traffic through There are various strategies that can be used to have DDS applications communicate between each other despite the fact that one or more of these applications are protected by a firewall. 尽管应用程序可能被防火墙隔离，还是有多种策略可以让DDS应用程序彼此通讯。 This HOWTO focuses in the situation where there...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/15/statically-configure-a-firewall-to-let-omg-dds-traffic-through.html",
        "teaser": null
      },{
        "title": "何小鹏卖的是车吗",
        "excerpt":"1116.何小鹏卖的是车吗   2021年1月16日   何小鹏卖的是车吗？   蔚来卖的并不单纯是汽车，而更像是卖各种圈子门票的“商会”，只不过它的门票不是纸，而是一台台定位于高端品牌的纯电动车。   苹果最大的价值，在于它的产品几乎都非常好用，而这好用的基础，则来源于一个封闭又庞大的苹果软件生态系统。   雷军最想做的是打造一套成功的小米软件生态。但小米最近的一份财报（2020Q3）中显示单季营收721.6亿元，互联网服务收入占比仅8%。它并没有摆脱自己硬件公司的身份。   亨利福特开启了流水线生产，才让汽车的成本迅速降低，让工人们都能开上了车。   丰田发明了精益生产的方式，成功在不太影响产能的情况下，迅猛的提升了产品质量。   汽车竞争的本质中的一大部分，一直是_生产方式、生产效率、生产质量_上的竞争。   对于中国来说，从传统燃油车转变为新能源车的最根本需求，一是能源安全，二是产业升级，而智能汽车则是_汽车电动化后的伴随着的大转变_。   电池成本在这几年里以大约15%的速度在逐年下降。   搭载了更多半导体的新能源汽车，会迅速卷入到摩尔定律的发展大潮之中。   新能源的造车竞争很快就会转变成为一场没有止境的硬件竞赛。   先有硬件生产成本的大幅下降，才能有软件公司凭借足够的算力，开展出全新的生态业务。   硬件的发展，会受到需求的制约。没有足够的需求，硬件的成本就无法降下来。   这是一个死循环。   唯二打破死循环的方法，一个_等待整个市场的转变_。   第二个办法，那就是自己搞。用何小鹏自己的话说，叫一直在点亮人类科技树上的各种分叉。   所以这就是为什么何小鹏领导下的小鹏汽车做了五花八门，令人眼花缭乱的各种事情，但追根到底何小鹏这个人，自始至终一直在做一件事情，那就是_永远在为新科技、新硬件做准备的路上_。   定位低于P7的小鹏P5，却更早使用上激光雷达。   飞行汽车是小鹏汽车提前点亮了科技树上的“飞行”，试图去真正改变人类未来的出行方式。   每一次攀登、点亮科技树上未知的一部分，都代表着我们未来的生活，又多了成百上千中可能性。   阅读原文   ","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/16/%E4%BD%95%E5%B0%8F%E9%B9%8F%E5%8D%96%E7%9A%84%E6%98%AF%E8%BD%A6%E5%90%97.html",
        "teaser": null
      },{
        "title": "拼多多漩涡,脘病毒,瑞辉疫苗死亡事件",
        "excerpt":"2021年1月17日 星期日  拼多多漩涡背后：数字码农，从未逃出残酷的原始社会   漩涡中心的拼多多   2020年12月29日凌晨1点30分，年仅23岁的拼多多女孩张某霏，在新疆下班回家的路上昏倒，最终抢救无效离世。   拼多多知乎官方帐号给出的回复足以让所有人心凉：   你看底层的人民，哪一个不是用命换钱，我一直不认为是资本的问题，而是这个社会的问题，这是一个用命拼的时代。你可以选择安逸的日子，但你就要选择安逸带来的后果，人是可以控制自己努力的，我们都可以。   1月7日，拼多多年轻的工程师王太虚，目睹了一位男同事被送上了救护车。他顺手拍下了一张图，并匿名发在了脉脉上。第二天，他被公司发现并且辞退。   1月9日中午，拼多多员工谭某从长沙27楼的家中跳楼自杀，当场离世。   谭某部门执行“两班倒”轮班制度： 值早班，早7点—晚11点工作；值晚班，晚7点—次日早7点，次日下午3点必须打卡上班。   互联网巨头的“丛林法则”   以多多买菜为例，供应链和物流是核心。拼多多来要在短期内追上快递巨头十几年打造出来的物流能力是不可能的。所以最好的办法就是烧钱和强力地推。这样一种模式注定了员工必须疯狂加班。   2018年7月，成立不到三年的拼多多就以240亿美金的市值，在美国成功上市，如今市值已经超过了2000亿美金。   创始人黄峥身家586亿美元，成为了中国第二大富豪。   当平台发展为垄断巨头，资本的本质便暴露无遗。   对商家，不断涨租收税；对外卖小哥等员工，不断压榨，追求极致的速度与效率；对消费者，通过大数据杀熟，同一家店、同一份东西，熟客永远比新客贵。   垄断时代   互联网经济的人口红利，已经被瓜分完了。互联网企业也被迫走入你死我活的角斗场。   “万维网之父”蒂姆·伯纳斯·李在2019年说到：   互联网已背离初衷，丧失了最初的精神，变得越来越闭塞与不平等，信息孤岛与商业垄断横生。   尾声   等待着这些打工人的，是狼性精神、996福报论、35岁中年危机……他们不得不参与这场注定会输的游戏，在剥削与自我剥削中，不断内卷。   在信奉效率规则的社会里，杀人的是效率的绳索，是资本的钩子。也许正如《资本万骨冢》里那句话所说——   远离了原始社会的人类，或许从来没有逃出人吃人的小部落。   食人部落与“笑死病”：哺乳动物为什么不能同类相食？朊病毒告诉你答案   病毒是由一个核酸分子（DNA或RNA）与蛋白质构成的非细胞形态的类生物。   朊病毒的意思就是蛋白质病毒。它并不是严格意义上的病毒，现在普遍称之为“朊毒体”。   朊病毒可以自我复制，有极强的抗性，紫外线照射、电离辐射、高温、各种生化试剂、人体内的胃酸、蛋白酶都无法破坏它的结构。   疯牛病学名叫做“牛海绵状脑病（BSE）”，就是由朊病毒引起的，它是一种牛的神经系统传染性疾病。   20世纪末，一些国家将其它动物的肉骨粉加入牛饲料中。而这些肉和骨头的来源，可能就包含得了疯牛病死去的动物。当朊病毒与牛体内的正常蛋白接触时，会以一种人类目前无法理解的方式诱导正常蛋白质转化为朊病毒蛋白。朊病毒越来越多，脑组织被破坏，形成海绵空泡样改变。   人会得一种和疯牛病很相似的变异克雅氏病。病人会在 12～18 个月内死亡。变异克雅氏病可能和疯牛病感染有关，传播途径主要是消化道传播，比如进食受疯牛病感染的牛肉。   在太平洋西南部的岛国巴布亚新几内亚的福尔部落有着生食已故亲人遗体的习俗，包括脑部。有人叫他们“食人部落”。早在1905年被科学家研究的人类朊病毒疾病“库鲁病”，就诞生于这个部落。因为患者最终在哈哈大笑中死去，所以又叫“笑死病”。废除吃死尸的习俗之后，潜伏期漫长的库鲁症终于逐渐消失。   同类相食的行为不会凭空产生朊病毒。朊病毒通常会随着宿主的死亡而终结。同类相食使朊病毒从死体重新进入活体，于是开始了新一轮复制。   辉瑞疫苗频现接种者死亡事件，西方主流媒体为何集体沉默？   挪威 2.5万人注射了辉瑞疫苗，23人死亡。 德国有10人死亡。 法国有1人死亡。   辉瑞疫苗属于mRNA疫苗，以治疗性为主。如果病人已经感染了新冠病毒或有其他疾病，疫苗产生的异性蛋白质可能引起过敏反应甚至其他副作用，也有可能加重本身基础性疾病的病情。   国产疫苗目前主要是灭活疫苗，广泛作为预防性疫苗使用，安全性要好很多。   俄国家杜马议员茹拉夫列夫谴责这是在新冠疫情大流行期间西方制药公司的商业战引发的可怕后果。   俄直投基金称曾通过推特分享俄“卫星-V”疫苗的所有信息，但他们的账户却被平台限制用户访问。  ","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/17/%E6%8B%BC%E5%A4%9A%E5%A4%9A%E6%BC%A9%E6%B6%A1,%E8%84%98%E7%97%85%E6%AF%92,%E7%91%9E%E8%BE%89%E7%96%AB%E8%8B%97%E6%AD%BB%E4%BA%A1%E4%BA%8B%E4%BB%B6.html",
        "teaser": null
      },{
        "title": "Mobileye-REM地图",
        "excerpt":"2021年1月18日 星期一 Mobileye REM地图如何解决高精地图落地难点？ 高精地图的挑战 规模化 2025年之后，自动驾驶会在消费者层面全面落地，Scale是一个无法规避的问题 鲜度 理想情况下，地图是在实时更新的 精度 车载系统(OnBoard System)检测的车辆和行人需要与高精地图(High Definiation Map)实现厘米级精度的匹配 通用高精地图制作方法的缺陷 全局坐标系下厘米级精度不是必需的 语义层数据生产难以自动化 没有车道线 转向规则 红绿灯 Stop/Yield Point 道路几何、限速、文化 Mobileye如何解决这些问题 从成百上千辆车获取检测信息并传送到云端 将每辆车的数据进行Alignment处理，生成高精度的地图数据 生成地图的语义数据 Harvesting 车辆检测landmarks、lane marks、driving path等语义信息。 成百上千的过路车辆会让检测结果越来越好。 Alignment 检测每个RSD中每个元素的6D Pose，然后对齐相同位置的元素，得到厘米度精度的driving path等信息。 每个车辆检测的道路元素位置都存在噪声，不能只依靠简单的求均值，而是依靠几何运算。 Modeling &amp; Semantics 使用神经网络 为什么语义理解离不开众包 可以在没有Lane Marking的道路上获取Driving Path 众包数据提供了复杂场景下的所有可通行路径 获得红绿灯与车道的关联关系、Yield Sign的Stop Point、Crosswalk与红绿灯的关联关系等 到没有Traffic...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/18/Mobileye-REM%E5%9C%B0%E5%9B%BE.html",
        "teaser": null
      },{
        "title": "四元数,DDS端口,自律的人",
        "excerpt":"2021年1月19日 星期二 欧拉角、四元数、旋转矩阵推导及相互关系 旋转与旋转矩阵 2D旋转 与右手系旋转方向相同的为旋转正方向 二维平面内旋转 \\[\\left( \\begin{matrix} x' \\\\ y' \\end{matrix} \\right) = \\left( \\begin{matrix} cosα &amp; −sinα\\\\ sinα &amp; cosα \\end{matrix} \\right) \\left( \\begin{matrix} x \\\\ y \\end{matrix} \\right)\\] 3D旋转 绕Z轴旋转α角 \\(\\left( \\begin{matrix} x' \\\\ y' \\\\ z \\end{matrix} \\right) = \\left( \\begin{matrix} cosα &amp; −sinα &amp;...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/19/%E5%9B%9B%E5%85%83%E6%95%B0,DDS%E7%AB%AF%E5%8F%A3,%E8%87%AA%E5%BE%8B%E7%9A%84%E4%BA%BA.html",
        "teaser": null
      },{
        "title": "PonyAI技术解读：自动驾驶中轨迹规划的探索和挑战",
        "excerpt":"PonyAI技术解读：自动驾驶中轨迹规划的探索和挑战 轨迹规划基本介绍 轨迹规划的概念 核心是解决车辆该怎么走的问题 输入 拓扑地图 障碍物 障碍物的预测轨迹 交通信号灯的状态 定位 导航 车辆状态 输出是一个轨迹，是时间到位置的函数 t→(x,y,z) 为什么需要决策模块 决策 限定非凸问题（轨迹规划）的解空间，将问题转化为凸的 使解更加稳定 NP-hard（非确定性多项式困难）问题 需要决策的场景 抢行还是让行 是否要冲黄灯 在哪两辆车之间变道、并线 是否要主动变道 是从左还是右绕行前方障碍物 纵向规划决策求解：动态规划 将t - s 图进行离散化 通过前边两步近似求出加速度，写出一个状态转移方程 只能一个大概的决策方法，即到底让或者不让，不能保证舒适 决策面临的挑战 1、NP-hard问题，不易直接求解 2、很难用规则去拟合人的经验 3、场景多变而复杂 横向规划 横向规划的解法 无车道的场景：业界大多都用搜索等路径生成的方式去处理。 有车道的情况： 离线生成参考线 将求解s→(x,y)的问题变为求解s→l的问题 l是指车辆在这个参考线上的横向偏移量 参考线的生成 可以利用高精地图离线计算 约束 需要在车道线内 控制上可实现 优化目标 离参考线近...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/20/PonyAI%E6%8A%80%E6%9C%AF%E8%A7%A3%E8%AF%BB-%E8%87%AA%E5%8A%A8%E9%A9%BE%E9%A9%B6%E4%B8%AD%E8%BD%A8%E8%BF%B9%E8%A7%84%E5%88%92%E7%9A%84%E6%8E%A2%E7%B4%A2%E5%92%8C%E6%8C%91%E6%88%98.html",
        "teaser": null
      },{
        "title": "英特尔FMCW激光雷达",
        "excerpt":"英特尔Mobileye最新发布的FMCW激光雷达有何过人之处 激光雷达原理 拍频原理 信号发生器发出频率随时间呈三角波变化的信号给发射机 接收机接收这个频率呈三角状变化的信号 通过对两个信号的拍频测量就可以得到距离信息 激光雷达性能指标 距离分辨力 单次测量中可区分的目标间最小距离 由光源调制带宽决定 角分辨力 单次探测中把距离R相同但是相对角度不同的目标区分开的能力 根据高斯光束的瑞利判据，光束发散角θ受到发射端准直器的孔径d与光载波波长λ的影响，满足θ=1.27λ/d 可区分的径向距离SA可表示为SA≥2R⋅sin(θ/2) 常用方法是增加天线孔径d以减小光束发散角 距离测量准确度 测得的距离分布的均值与真实距离之间的差距 主要受到光源频率调制的线性度和测量系统校准的影响 角测量准确度 受发射端扫描器件的角度准确度影响 距离测量与角测量结果的精度 对同一目标测量结果的一致性程度 受到光源的各参数稳定度和角扫描重复性与最小步长的影响 测量速率 获得一个探测数据的时间的倒数 主要受限于调制信号重复速率 高重复速率和长可探测距离不可兼得 调试技术 内调制技术 调制过程与激光振荡建立同时进行的调制 做成芯片是目前业内主要研发方向 半导体激光器本身的结电容限制了激光器的响应速率以及腔内光场建立时间的存在，使得可调谐范围、调谐速率、输出线宽等参数较难进一步提高 外调制技术 在激光振荡建立之后，在激光射出的光路上使用调制器对光场参数进行调 声光调制 工作带宽相对较窄 电光调制 体积庞大，难以芯片化 主要用在非车载领域 FMCW激光雷达的优势 信噪比高 功耗低 与距离物体远近不直接相关 ToF激光雷达越远测距准确度越低 与物体运动速度不直接相关 相对运动越快，ToF测距准确度越差，甚至出现物体畸变 FMCW激光雷达的缺点 成本高 旁瓣干扰 轻微延迟...","categories": [],
        "tags": [],
        "url": "https://zzmfish.github.io/DailyRead/2021/01/20/%E8%8B%B1%E7%89%B9%E5%B0%94FMCW%E6%BF%80%E5%85%89%E9%9B%B7%E8%BE%BE.html",
        "teaser": null
      }]
